[
    {
        "_id": "product",
        "id": "e2aadef8-833b-4b6e-be28-92adacb23c72",
        "name": "Soldier Five : The Real Truth About The Bravo Two Zero Mission",
        "searchName": "soldier five : the real truth about the bravo two zero mission",
        "description": "SOLDIER FIVE is an elite soldier's explosive memoir of his time within the Special Air Service (SAS) and, in particular, his experiences during the 1991 Gulf War. As a member of the Special Forces patrol now famously known by its call sign Bravo Two Zero, he and seven others were inserted hundreds of kilometres behind enemy lines. Their mission to reconnoitre targets, undertake surveillance of Scud missil sites and sabotage Iraqi communications links was to end in desperate failure.From the outset, the patrol was dogged by problems that contributed both directly and indirectly to the demise of the mission. The patrol's compromise, and subsequent attempts to evade Iraqi troops, resulted in four members of Bravo Two Zero being captured and a further three killed. One escaped. But the story goes further that the Gulf War itself. Despite numerous books, films and articles on the same subject, the British Government has done its utmost to thwart the release of SOLDIER FIVE, at one stage claiming the book in its entirety was confidential. A campaign of harassment that took some four and a half years of litigation to resolve has now resulted in this controversial publication. SOLDIER FIVE is a gripping and suspenseful account of one man's experiences as a Special Forces soldier. Revealing his conflicts and loyalties, and the relationships he forged both on and off the battlefield, this book is the resolution of a soldier's determined fight to see his story told.",
        "price": 7,
        "quantity": 97352,
        "evidence": false,
        "discount": 28,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8401/9781840189070.jpg"
        ],
        "categories": [
            "Biography: General",
            "Biography: Historical, Political & Military",
            "True War  & Combat Stories",
            "Asian History",
            "Middle Eastern History",
            "20th Century History: C 1900  To C 2000",
            "Postwar 20th Century History, From C 1945 To C 2000",
            "Military History"
        ],
        "discountedPrice": 5.04
    },
    {
        "_id": "product",
        "id": "7f276f99-b997-4d16-9529-2b9685eebaf4",
        "name": "Underbelly : The Gangland War",
        "searchName": "underbelly : the gangland war",
        "description": "John Moran and Carl Williams were the two biggest rival drug barons in Australia. They certainly weren't partners, but they weren't sworn enemies. One day, they had a meeting to end a dispute over drug money. Thinking he could scare his rival into submission, Moran pulled the trigger on Carl but decided not to finish the job off. It turned out to be the biggest mistake of his life.  Carl was hell bent on revenge. Within months, most of the Moran family and a host of underworld figures would die in an astonishing spate of revenge killings which shook the public and the police to the core. Murder, greed, drugs, sex and corruption abound in a story that reads like a piece of gangster fiction. But in Underbelly, the bullets and the blood are grippingly real.  This is true crime of the highest order - the amazing story of a powerful man who did things his way and eventually orchestrated his own terrible downfall.",
        "price": 12,
        "quantity": 95,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9781/8445/9781844547371.jpg"
        ],
        "categories": [
            "True Crime Biographies",
            "True Crime Books"
        ],
        "discountedPrice": 9.48
    },
    {
        "_id": "product",
        "id": "aea4c751-9d50-411d-8040-133eb2213a6b",
        "name": "A Sir Phillip, Con Amor",
        "searchName": "a sir phillip, con amor",
        "description": "Sir Phillip knew that Eloise Bridgerton was a spinster, and so he'd proposed, figuring that she'd be homely and unassuming. Except she wasn't. The beautiful woman on his doorstep was anything but quiet, and when she stopped talking long enough to close her mouth, all he wanted to do was kiss her and more.",
        "price": 2,
        "quantity": 79718,
        "evidence": false,
        "discount": 29,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9788/4163/9788416327867.jpg"
        ],
        "categories": [
            "Romance",
            "Romance Books",
            "Historical Romance",
            "Historical Romance"
        ],
        "discountedPrice": 1.42
    },
    {
        "_id": "product",
        "id": "9f038c4c-22ce-4a87-ade9-1c659a726298",
        "name": "QI: The Third Book of General Ignorance",
        "searchName": "qi: the third book of general ignorance",
        "description": "The Third Book of General Ignorance  gathers together 180 questions, both new and previously featured on the  BBC TV programme's popular 'General Ignorance' round, and show why,  when it comes to general knowledge, none of us knows anything at all.",
        "price": 13,
        "quantity": 99597,
        "evidence": false,
        "discount": 94,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5713/9780571308996.jpg"
        ],
        "categories": [
            "General Encyclopaedias",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.78
    },
    {
        "_id": "product",
        "id": "706d0042-c908-4fc5-9e00-a0c519a9623b",
        "name": "The Hidden Power of F*cking Up",
        "searchName": "the hidden power of f*cking up",
        "description": "The Try Guys deliver their first book-an inspirational self-improvement guide that teaches you that the path to success is littered with humiliating detours, embarrassing mistakes, and unexpected failures.",
        "price": 9,
        "quantity": 23357,
        "evidence": false,
        "discount": 48,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/0083/9780008352516.jpg"
        ],
        "categories": [
            "Assertiveness, Motivation & Self-esteem",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 4.68
    },
    {
        "_id": "product",
        "id": "85e64de0-1364-4dd7-a3d0-33119429ffd1",
        "name": "The Grand Design",
        "searchName": "the grand design",
        "description": "When and how did the universe begin? Why are we here? Is the apparent 'grand design' of our universe evidence for a benevolent creator who set things in motion? Or does science offer another explanation?",
        "price": 16,
        "quantity": 58231,
        "evidence": false,
        "discount": 90,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5538/9780553819229.jpg"
        ],
        "categories": [
            "Science: General Issues",
            "Popular Science"
        ],
        "discountedPrice": 1.6
    },
    {
        "_id": "product",
        "id": "6137d0a9-f256-4dd3-84ee-978903318b63",
        "name": "1,227 QI Facts To Blow Your Socks Off",
        "searchName": "1,227 qi facts to blow your socks off",
        "description": "Did you know that: cows moo in regional accents; the entire internet weighs less than a grain of sand; the dialling code from Britain to Russia is 007; potatoes have more chromosomes than human beings; the London Underground has made more money from its famous map than it has from running trains; Tintin is called Tantan in Japanese because TinTin is pronounced 'Chin chin' and means penis; the water in the mouth of a blue whale weighs more than its body; Scotland has twice as many pandas as Conservative MPs; Saddam's bunker was designed by the grandson of the woman who built Hitler's bunker; Under the Wildlife and Countryside Act of 1981, it is explicitly illegal in Britain to use a machinegun to kill a hedgehog.",
        "price": 19,
        "quantity": 18877,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571297931.jpg"
        ],
        "categories": [
            "General Encyclopaedias",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.89
    },
    {
        "_id": "product",
        "id": "8799ad6c-9e53-4a2f-b2e8-33fd202fac8c",
        "name": "The 100 Most Pointless Arguments in the World : A pointless book written by the presenters of the hit BBC 1 TV show",
        "searchName": "the 100 most pointless arguments in the world : a pointless book written by the presenters of the hit bbc 1 tv show",
        "description": "We've all had them, those pointless arguments that are seemingly impossible to solve. We've been round in circles trying to work out what came first, the chicken or the egg? Don't get us started on the debate of what we are all here for? And you're bound to have had sleepless nights pondering which ingredient you simply can't do without in a full English Breakfast - sausage or bacon. Well worry no more, here to help you solve some of life's biggest - and most pointless - conundrums are Alexander Armstrong and Richard Osman.",
        "price": 13,
        "quantity": 91566,
        "evidence": false,
        "discount": 91,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4447/9781444762082.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 1.17
    },
    {
        "_id": "product",
        "id": "b1837420-6c0c-4160-8a10-336cc089fa62",
        "name": "Waking Up : A Guide to Spirituality Without Religion",
        "searchName": "waking up : a guide to spirituality without religion",
        "description": "For the millions of Americans who want spirituality without religion, Sam Harris's latest New York Times bestseller is a guide to meditation as a rational practice informed by neuroscience and psychology. From Sam Harris, neuroscientist and author of numerous New York Times bestselling books, Waking Up is for the twenty percent of Americans who follow no religion but who suspect that important truths can be found in the experiences of such figures as Jesus, the Buddha, Lao Tzu, Rumi, and the other saints and sages of history. Throughout this book, Harris argues that there is more to understanding reality than science and secular culture generally allow, and that how we pay attention to the present moment largely determines the quality of our lives. Waking Up is part memoir and part exploration of the scientific underpinnings of spirituality. No other book marries contemplative wisdom and modern science in this way, and no author other than Sam Harris--a scientist, philosopher, and famous skeptic--could write it.",
        "price": 15,
        "quantity": 40105,
        "evidence": false,
        "discount": 60,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9781/4516/9781451636024.jpg"
        ],
        "categories": [
            "Spirituality & Religious Experience",
            "Religious Groups: Social & Cultural Aspects",
            "Philosophy Of Science",
            "Mind, Body, Spirit: Thought & Practice"
        ],
        "discountedPrice": 6
    },
    {
        "_id": "product",
        "id": "de5de4ec-e7d5-40c7-bf0f-f06ef9efb9d8",
        "name": "Art Of Coloring: Muppets",
        "searchName": "art of coloring: muppets",
        "description": "Part of the Art of Coloring series, which has sold over 2 million copies across the U.S.",
        "price": 16,
        "quantity": 73362,
        "evidence": false,
        "discount": 46,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4847/9781484788899.jpg"
        ],
        "categories": [
            "Art History: From c 1960",
            "Drawing",
            "Coping With Stress",
            "Crafts & Hobbies",
            "TV Tie-in Humour",
            "Interior Design, Decor & Style Guides",
            "Stationery"
        ],
        "discountedPrice": 8.64
    },
    {
        "_id": "product",
        "id": "9aac7964-c154-49d7-bae5-07b7c34e2fa2",
        "name": "Stranger Fillings : Edible recipes to turn your world upside down!",
        "searchName": "stranger fillings : edible recipes to turn your world upside down!",
        "description": "When a young boy goes missing, a small town uncovers a mystery involving secret recipes, supernatural whisking forces and one strange ingredient...",
        "price": 3,
        "quantity": 7482,
        "evidence": false,
        "discount": 14,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4091/9781409173359.jpg"
        ],
        "categories": [
            "General Cookery",
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 2.58
    },
    {
        "_id": "product",
        "id": "707718f0-a2a2-40f8-8749-51602e8bd3f5",
        "name": "Biology of Belief: 10th Anniversary Edition",
        "searchName": "biology of belief: 10th anniversary edition",
        "description": "",
        "price": 9,
        "quantity": 11908,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4019/9781401938697.jpg"
        ],
        "categories": [
            "Popular Science",
            "Genetics (non-medical)",
            "Mind, Body, Spirit: Thought & Practice"
        ],
        "discountedPrice": 2.79
    },
    {
        "_id": "product",
        "id": "62a1630b-95e7-423d-bcea-32bd6f583e28",
        "name": "Olivia Dress Me Up : A Magnetic Kit",
        "searchName": "olivia dress me up : a magnetic kit",
        "description": "Olivia believes in making every day an adventure, and you can help her with this fun, interactive mini kit featuring a cute magnet of Olivia, along with a full range of magnetic outfits and accessories to mix and match -  now she's ready for anything! Also included is a 16-page full-colour sticker book.",
        "price": 5,
        "quantity": 50789,
        "evidence": false,
        "discount": 92,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7624/9780762451012.jpg"
        ],
        "categories": [
            "TV Tie-in Humour",
            "Miscellaneous Items",
            "Children's Hobby & Gaming Books"
        ],
        "discountedPrice": 0.4
    },
    {
        "_id": "product",
        "id": "294ed712-62b7-4b42-add3-f2efa3d0c0f5",
        "name": "Bleak Expectations",
        "searchName": "bleak expectations",
        "description": "Based on the beloved Radio 4 series, BLEAK EXPECTATIONS recounts the remarkable adventures of young Pip Bin as he tries to make his way in a world made all horrible by the machinations of his cruel guardian, Mr Gently Benevolent.",
        "price": 6,
        "quantity": 60553,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4721/9781472112583.jpg"
        ],
        "categories": [
            "Radio",
            "Radio",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 4.74
    },
    {
        "_id": "product",
        "id": "263beea4-26ea-47f8-86dc-110f6158c8c8",
        "name": "Reaching Down the Rabbit Hole : Extraordinary Journeys into the Human Brain",
        "searchName": "reaching down the rabbit hole : extraordinary journeys into the human brain",
        "description": "What is it like to try to heal the body when the mind is under attack? In this gripping and illuminating book, Dr Allan Ropper reveals the extraordinary stories behind some of the life-altering afflictions that he and his staff are confronted with at the Neurology Unit of Harvard's Brigham and Women's Hospital.",
        "price": 7,
        "quantity": 72082,
        "evidence": false,
        "discount": 55,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7823/9781782395508.jpg"
        ],
        "categories": [
            "Physiological & Neuro-psychology, Biopsychology",
            "Neurology & Clinical Neurophysiology",
            "Clinical Psychology",
            "Popular Science",
            "Neurosciences"
        ],
        "discountedPrice": 3.15
    },
    {
        "_id": "product",
        "id": "9070fce8-e0ac-4aec-98c9-6c5d3caaa313",
        "name": "QI Annual 2011",
        "searchName": "qi annual 2011",
        "description": "Imagine an incredible edition of Guinness World Records created by Stephen Fry, Alan Davies, Jo Brand, Bill Bailey and other regular guests on the QI show... The QI Annual 2011 features original contributions from stand up comedians and presents a whole heap-full of QI's weird, wonderful and really quite interesting facts.",
        "price": 17,
        "quantity": 33513,
        "evidence": false,
        "discount": 63,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5713/9780571308835.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 6.29
    },
    {
        "_id": "product",
        "id": "c52be6ce-ccec-49f0-8309-ee66dd849f21",
        "name": "Insufficiently Welsh",
        "searchName": "insufficiently welsh",
        "description": "Griff Rhys Jones is searching for that Welsh part of himself that he has felt ever since being forced to sing in the choir in church and pack down for the school first XV, all in suburban Essex. Join Griff on his journey through Snowdonia, Anglesey, the Gower, mid Wales, Brecon, Pembrokeshire, north Wales and Monmouthshire. Packed with all manners of weird, wonderful and enlightening facts, you'll learn as much about Wales as you do Griff. \"I am going out on the road to search for my Celtic roots and explore 'the land of my aunties'. The language, the landscape, rugby, dogs, legends, botany, wildlife, furniture and a bit more on the side: I looked into them all and here are the results...\" But is Griff Rhys Jones Insufficiently Welsh?",
        "price": 7,
        "quantity": 14152,
        "evidence": false,
        "discount": 5,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9098/9781909844995.jpg"
        ],
        "categories": [
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Travel Writing"
        ],
        "discountedPrice": 6.65
    },
    {
        "_id": "product",
        "id": "776c52ec-9eb9-4a7b-8e18-7f6d935b1f79",
        "name": "Bonk : The Curious Coupling Of Sex And Science",
        "searchName": "bonk : the curious coupling of sex and science",
        "description": "Few things are as fundamental to human happiness as sex, and few writers are as entertaining about the subject as Mary Roach.",
        "price": 7,
        "quantity": 71850,
        "evidence": false,
        "discount": 39,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8476/9781847672360.jpg"
        ],
        "categories": [
            "Popular Science",
            "Sex & Sexuality, Sex Manuals"
        ],
        "discountedPrice": 4.27
    },
    {
        "_id": "product",
        "id": "d403125d-069b-4c6d-a64f-79c1570d0f42",
        "name": "Steptoe & Son: Series 5 & 6 : 15 episodes of the classic BBC radio sitcom",
        "searchName": "steptoe & son: series 5 & 6 : 15 episodes of the classic bbc radio sitcom",
        "description": "Series 5 and 6 of the vintage radio sitcom starring Harry H Corbett and Wilfrid Brambell, adapted from the much-loved TV series.",
        "price": 16,
        "quantity": 89783,
        "evidence": false,
        "discount": 45,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7852/9781785296147.jpg"
        ],
        "categories": [
            "Radio",
            "Radio",
            "Contemporary Fiction",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 8.8
    },
    {
        "_id": "product",
        "id": "ab8dcb12-ca53-401b-b8a8-ddd2d0064772",
        "name": "A Travel Guide to the Seven Kingdoms of Westeros",
        "searchName": "a travel guide to the seven kingdoms of westeros",
        "description": "Bustling cities, ancient wonders and snow-peaked mountain ranges; the Seven Kingdoms of Westeros are an attractive destination for travellers (there's a reason why so many invaders have crossed the Narrow Sea over the centuries).  This guidebook will escort you through a realm rich in culture, jaw-dropping natural beauty and Lannister gold; helping you to navigate a continent where the landscape shifts almost as often as the balance of political power. Whether you're looking to don your furs and follow in the footsteps of the First Men, spend an evening sharing summerwine (and a lot more besides) in Dorne, or simply root out the best 'Bowl o'Brown' in King's Landing; this travel companion has you covered.  Created with you in mind, this book (based entirely on George R. R Martin's smash hit fantasy series) includes:  'Must See' best sights in the Seven Kingdoms (and beyond).  Practical advice on getting around, where to stay and how to ensure you keep your head attached to your shoulders for the duration of your visit. An amusing and informative look at the history of the region for those wanting to learn more about their surroundings.No spoilers for those who are fans of the HBO show.",
        "price": 16,
        "quantity": 45637,
        "evidence": false,
        "discount": 73,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7841/9781784183721.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Dance & Other Performing Arts",
            "Dance & Other Performing Arts",
            "Contemporary Fiction",
            "Fantasy",
            "Fantasy Books",
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 4.32
    },
    {
        "_id": "product",
        "id": "cce840e3-5032-4ad3-b6fb-614ed32cb2fd",
        "name": "The Seven Daughters Of Eve",
        "searchName": "the seven daughters of eve",
        "description": "In 1994 Professor Bryan Sykes, a leading world authority on DNA and human evolution, was called in to examine the frozen remains of a man trapped in glacial ice in northern Italy. News of the discovery of the Ice Man and his age, which was put at over five thousand years old, fascinated the world. But what made the story particularly extraordinary was that Professor Sykes was also able to track down a living generic relative of the Ice Man, a woman living in Britain today.",
        "price": 13,
        "quantity": 17485,
        "evidence": false,
        "discount": 62,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5521/9780552152181.jpg"
        ],
        "categories": [
            "Popular Science",
            "Genetics (non-medical)"
        ],
        "discountedPrice": 4.94
    },
    {
        "_id": "product",
        "id": "5522bdce-8fe2-41cd-b9b9-49bfaa01abfa",
        "name": "Mortimer & Whitehouse: Gone Fishing",
        "searchName": "mortimer & whitehouse: gone fishing",
        "description": "The Sunday Times bestseller",
        "price": 16,
        "quantity": 21236,
        "evidence": false,
        "discount": 82,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7887/9781788701952.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Autobiography: Arts & Entertainment",
            "TV Tie-in Humour",
            "Fishing, Angling"
        ],
        "discountedPrice": 2.88
    },
    {
        "_id": "product",
        "id": "a5398056-98d3-44da-9c42-3ac04060ae0a",
        "name": "Otherhood",
        "searchName": "otherhood",
        "description": "First published as Whatever Makes You Happy, the hilarious and moving novel about mothers and their adult sons, now a Netflix original movie starring Felicity Huffman, Angela Bassett and Patricia Arquette which has now been viewed on over 27 million accounts worldwide",
        "price": 10,
        "quantity": 50519,
        "evidence": false,
        "discount": 0,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5266/9781526608352.jpg"
        ],
        "categories": [
            "Contemporary Fiction",
            "Family & Relationships",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 10
    },
    {
        "_id": "product",
        "id": "94ac8666-a92a-453e-8965-d12fbbc857d3",
        "name": "The Fourth Industrial Revolution",
        "searchName": "the fourth industrial revolution",
        "description": "'In this book, Klaus Schwab and the World Economic Forum contribute significantly to one of the most important issues of our time - how to move forward in the Fourth Industrial Revolution' Jack Ma, Executive Chairman, Alibaba Group Holding, People's Republic of China",
        "price": 3,
        "quantity": 69798,
        "evidence": false,
        "discount": 66,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/2413/9780241300756.jpg"
        ],
        "categories": [
            "Social Forecasting, Future Studies",
            "International Relations",
            "Revolutionary Groups & Movements",
            "International Trade",
            "International Trade",
            "Business Innovation",
            "E-commerce: Business Aspects",
            "Business Ethics",
            "International Business",
            "Impact Of Science & Technology On Society",
            "Technology: General Issues"
        ],
        "discountedPrice": 1.02
    },
    {
        "_id": "product",
        "id": "e9fc3b80-9375-4605-816f-0ea0736f7e45",
        "name": "How to Be Narstie",
        "searchName": "how to be narstie",
        "description": "Mans here to help you help yourself.",
        "price": 18,
        "quantity": 18769,
        "evidence": false,
        "discount": 73,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5291/9781529106305.jpg"
        ],
        "categories": [
            "Music",
            "Music",
            "Biography: Arts & Entertainment",
            "Autobiography: Arts & Entertainment",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 4.86
    },
    {
        "_id": "product",
        "id": "279b3366-1067-4740-ba3d-a53064594d82",
        "name": "Livin' the Dreem : A Year in My Life",
        "searchName": "livin' the dreem : a year in my life",
        "description": "Harry Hill's unexpurgated diary of his year promises to do for the celebrity memoir what the Hadron Collider has done for particle acceleration.",
        "price": 1,
        "quantity": 71332,
        "evidence": false,
        "discount": 24,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571273386.jpg"
        ],
        "categories": [
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 0.76
    },
    {
        "_id": "product",
        "id": "4cf0311e-db85-458a-bd56-48e509c1dfd9",
        "name": "Where Good Ideas Come from : The Natural History of Innovation",
        "searchName": "where good ideas come from : the natural history of innovation",
        "description": "A fascinating deep dive on innovation from the New York Times bestselling author of How We Got To Now and Unexpected Life The printing press, the pencil, the flush toilet, the battery--these are all great ideas. But where do they come from? What kind of environment breeds them? What sparks the flash of brilliance? How do we generate the breakthrough technologies that push forward our lives, our society, our culture? Steven Johnson's answers are revelatory as he identifies the seven key patterns behind genuine innovation, and traces them across time and disciplines. From Darwin and Freud to the halls of Google and Apple, Johnson investigates the innovation hubs throughout modern time and pulls out the approaches and commonalities that seem to appear at moments of originality.",
        "price": 17,
        "quantity": 27103,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9781/5944/9781594485381.jpg"
        ],
        "categories": [
            "Social & Cultural History",
            "Society & Culture: General",
            "Psychology",
            "Management: Leadership & Motivation",
            "Impact Of Science & Technology On Society",
            "History Of Science",
            "Inventions & Inventors"
        ],
        "discountedPrice": 5.27
    },
    {
        "_id": "product",
        "id": "64c8b344-1f41-45e8-9ca5-eb1d4e60ce83",
        "name": "Only Fools and Horses : 16 Classic BBC TV Soundtracks",
        "searchName": "only fools and horses : 16 classic bbc tv soundtracks",
        "description": "Sixteen TV soundtracks of the award-winning TV show collected together for the first time, starring David Jason as ambitious market trader Del Boy Trotter, and Nicholas Lyndhurst as his younger brother Rodney Trotter.",
        "price": 12,
        "quantity": 578,
        "evidence": false,
        "discount": 45,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7852/9781785299667.jpg"
        ],
        "categories": [
            "Television Scripts & Screenplays",
            "Television Scripts & Screenplays",
            "Radio",
            "Radio",
            "Contemporary Fiction",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 6.6
    },
    {
        "_id": "product",
        "id": "2760c6dc-0e71-41d3-aac7-f63abf7a8a4f",
        "name": "How to Be Narstie",
        "searchName": "how to be narstie",
        "description": "This book is for da real Gs and ladies.",
        "price": 13,
        "quantity": 20373,
        "evidence": false,
        "discount": 90,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5291/9781529106299.jpg"
        ],
        "categories": [
            "Music",
            "Music",
            "Biography: Arts & Entertainment",
            "Autobiography: Arts & Entertainment",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 1.3
    },
    {
        "_id": "product",
        "id": "6f89e6f0-f342-41a9-98b7-d3b27c7be169",
        "name": "The Future of Humanity : Terraforming Mars, Interstellar Travel, Immortality, and Our Destiny Beyond",
        "searchName": "the future of humanity : terraforming mars, interstellar travel, immortality, and our destiny beyond",
        "description": "A SUNDAY TIMES BOOK OF THE YEAR",
        "price": 6,
        "quantity": 27145,
        "evidence": false,
        "discount": 60,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1419/9780141986067.jpg"
        ],
        "categories": [
            "Social Forecasting, Future Studies",
            "Popular Science",
            "Astronomy, Space & Time",
            "Cosmology & The Universe",
            "Global Warming",
            "Popular Astronomy & Space"
        ],
        "discountedPrice": 2.4
    },
    {
        "_id": "product",
        "id": "894b271d-312a-482e-b179-535b646bbe51",
        "name": "TV Go Home",
        "searchName": "tv go home",
        "description": "TV Go Home began life in the late 1990s as an outrageously funny website by Charlie Brooker which parodied the Radio Times, and was turned into a book in 2001 when Brooker was still a relative unknown. It was a brutal and surreal satire of the world of TV, media and celebrity, written with Brooker's trademark savage wit. Unavailable for some years, we are republishing it to reach his many thousands of new fans.",
        "price": 9,
        "quantity": 693,
        "evidence": false,
        "discount": 3,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571272198.jpg"
        ],
        "categories": [
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 8.73
    },
    {
        "_id": "product",
        "id": "b2514cea-b44e-4c9c-afeb-d50d2fd4d48e",
        "name": "Alan Partridge: Nomad",
        "searchName": "alan partridge: nomad",
        "description": "In ALAN PARTRIDGE: NOMAD, Alan dons his boots, windcheater and scarf and embarks on an odyssey through a place he once knew - it's called Britain - intent on completing a journey of immense personal significance.",
        "price": 6,
        "quantity": 83755,
        "evidence": false,
        "discount": 7,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4091/9781409160236.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.58
    },
    {
        "_id": "product",
        "id": "6811cea3-172e-4df6-bc5c-ec3f5709bf30",
        "name": "The World is Flat : The Globalized World in the Twenty-first Century",
        "searchName": "the world is flat : the globalized world in the twenty-first century",
        "description": "The beginning of the twenty-first century will be remembered, Friedman argues, not for military conflicts or political events, but for a whole new age of globalization - a 'flattening' of the world. The explosion of advanced technologies now means that suddenly knowledge pools and resources have connected all over the planet, levelling the playing field as never before, so that each of us is potentially an equal - and competitor - of the other. The rules of the game have changed forever - but does this 'death of distance', which requires us all to run faster in order to stay in the same place, mean the world has got too small and too flat too fast for us to adjust? Friedman brilliantly demystifies the exciting, often bewildering, global scene unfolding before our eyes, one which we sense but barely yet understand. The World is Flat is the most timely and essential update on globalization, its successes and its discontents, powerfully illuminated by a world-class writer.",
        "price": 20,
        "quantity": 20246,
        "evidence": false,
        "discount": 9,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1410/9780141034898.jpg"
        ],
        "categories": [
            "General & World History",
            "21st Century History: From C 2000 -",
            "Globalization",
            "Economic History",
            "Economic History",
            "Impact Of Science & Technology On Society"
        ],
        "discountedPrice": 18.2
    },
    {
        "_id": "product",
        "id": "d4ed0787-c22f-41dd-8526-a3bb0d87607e",
        "name": "South Park: Butters vs. Professor Chaos",
        "searchName": "south park: butters vs. professor chaos",
        "description": "The most popular character (or is that \"characters\"?) in \"South Park\" can now be yours! Over the last few years Butters has become a fan favorite and his alter-ego, Professor Chaos, has only increased his popularity. This kit features a spectacular dual-window Mega Mini Kit box, and will release in time for Comedy Central's extensive 15th Anniversary of South Park events in October 2011.The kit includes one Butters figurine and one Professor Chaos figurine, plus a 16-page sticker booklet with eight full-color images of some of the most famous scenes featuring Butters and Professor Chaos.(c)2011 Comedy Partners. All Rights Reserved. SOUTH PARK and all related titles, logos, and characters are trademarks of Comedy Partners.",
        "price": 16,
        "quantity": 72613,
        "evidence": false,
        "discount": 5,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7624/9780762442560.jpg"
        ],
        "categories": [
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Miscellaneous Items"
        ],
        "discountedPrice": 15.2
    },
    {
        "_id": "product",
        "id": "a94ea657-8047-4359-b152-1afd2cbb6c67",
        "name": "The Brady Bunch Guide to Life",
        "searchName": "the brady bunch guide to life",
        "description": "The quirky wisdom and sensible advice of The Brady Bunch - the first family of 1970's television - have been drawn from five seasons of episodes and condensed into a pocket - sized guide to life.. The Brady Bunch show first went on air in 1974 and has continued to broadcast in reruns. A touchstone of American popular culture and a pure example of classic TV, it has been reincarnated in the blockbuster movies, The Brady Bunch Movie and A Very Brady Sequel.. The show's format is perfect for scripting \"life lessons\" and in-jokes. Each episode dealt with some aspect of life that, in 30 minutes, was neatly resolved, complete with an important moral.. This Miniature Edition is a perfect slice of nostalgia for anyone who enjoys the occasional rerun of a TV classic. It includes hilarious and very Brady tips on how to deal with siblings, conquer pre-teen angst and generally be an all-round balanced person.",
        "price": 19,
        "quantity": 66362,
        "evidence": false,
        "discount": 73,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7624/9780762420667.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Assertiveness, Motivation & Self-esteem",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.13
    },
    {
        "_id": "product",
        "id": "2a8ed8a3-74ed-44b3-9888-93f0399b9758",
        "name": "The Oxford Book of Modern Science Writing",
        "searchName": "the oxford book of modern science writing",
        "description": "Selected and introduced by Richard Dawkins, The Oxford Book of Modern Science Writing is a celebration of the finest writing by scientists for a wider audience - revealing that many of the best scientists have displayed as much imagination and skill with the pen as they have in the laboratory.",
        "price": 9,
        "quantity": 11475,
        "evidence": false,
        "discount": 47,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1992/9780199216819.jpg"
        ],
        "categories": [
            "Anthologies (non-poetry)",
            "Science: General Issues",
            "History Of Science",
            "Popular Science",
            "Biology, Life Sciences"
        ],
        "discountedPrice": 4.77
    },
    {
        "_id": "product",
        "id": "7dc887ef-5db4-44aa-a350-378ba95c5c51",
        "name": "How I Met Your Mother Mini Kit : Mini Barney Bobblehead Included!",
        "searchName": "how i met your mother mini kit : mini barney bobblehead included!",
        "description": "Legen . . . wait for it . . . dary!",
        "price": 7,
        "quantity": 48778,
        "evidence": false,
        "discount": 12,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7624/9780762452590.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Miscellaneous Items"
        ],
        "discountedPrice": 6.16
    },
    {
        "_id": "product",
        "id": "ea0229a5-c6c4-433e-9788-e9fc14f07797",
        "name": "The \"League of Gentlemen\"'s Book of Precious Things",
        "searchName": "the \"league of gentlemen\"'s book of precious things",
        "description": "\"The League of Gentlemen\" have been making audiences laugh for years, but what makes them tick and what is behind their dark, twisted humour? In this book, all four members have assembled a stunning collection of prose, poetry, sketches, lyrics and classic film scenes to create a very special \"Book of Precious Things\". \"The League of Gentlemen\" was critically acclaimed when the first series was shown on BBC2 in 1999. Already known from their radio show \"On The Town...,\" the League were much discussed, with their unique mixture of very black comedy and harrowing social observation set in the fictional town of Royston Vasey. With a mind-blowing mixture of influences from \"Hammer Horror\", \"Carry On\" and Martin Amis to Monty Python, Shakespeare and Victoria Wood, the League are utterly unique and more than a little disturbing!",
        "price": 14,
        "quantity": 53863,
        "evidence": false,
        "discount": 75,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8537/9781853756214.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 3.5
    },
    {
        "_id": "product",
        "id": "ff9e6793-dcf0-4f34-8f44-92cc0d1df65f",
        "name": "Reactions : An Illustrated Exploration of Elements, Molecules, and Change in the Universe",
        "searchName": "reactions : an illustrated exploration of elements, molecules, and change in the universe",
        "description": "With Reactions bestselling author Theodore Gray continues the journey through our molecular and chemical world that began with the tour de force The Elements and continued with Molecules. In The Elements, Gray gave us a never-before-seen, mesmerizing photographic view of the 118 elements in the periodic table. In Molecules, with the same phenomenal photographic acumen, plus beautifully rendered computer generated graphics, he showed us how the elements combine to form the content that makes up our universe, from table salt to oxygen to the panoply of colors and smells that surround us.",
        "price": 17,
        "quantity": 5434,
        "evidence": false,
        "discount": 4,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3163/9780316391221.jpg"
        ],
        "categories": [
            "Science: General Issues",
            "Scientific Equipment, Experiments & Techniques",
            "History Of Science",
            "Atomic & Molecular Physics",
            "Chemistry Books",
            "Organic Chemistry",
            "Molecular Biology"
        ],
        "discountedPrice": 16.32
    },
    {
        "_id": "product",
        "id": "88b0b386-8f9c-4748-88ce-5d9da5ac3463",
        "name": "Have I Got News For You: Guide to Modern Britain",
        "searchName": "have i got news for you: guide to modern britain",
        "description": "Did you know that foreigners who want to live in Britain have to pass a government test to get in? It's true, and some of the questions are harder than \"Why does everyone hate Manchester United?\"",
        "price": 15,
        "quantity": 47507,
        "evidence": false,
        "discount": 40,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8460/9781846075469.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Cultural Studies",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 9
    },
    {
        "_id": "product",
        "id": "fd75eaf9-dba0-4b3c-b8aa-bb2acc444131",
        "name": "Giles and Sue Live The Good Life",
        "searchName": "giles and sue live the good life",
        "description": "For the 35th anniversary of iconic sitcom The Good Life, and in homage to Tom and Barbara Good, Giles Coren and Sue Perkins are trying out self-sufficiency in the suburbs. But is it really possible to live out of the rat race and off grid in modern Britain?",
        "price": 12,
        "quantity": 14977,
        "evidence": false,
        "discount": 96,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8499/9781849900591.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Self-sufficiency",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.48
    },
    {
        "_id": "product",
        "id": "fb535d59-5702-4fc6-97ec-69c40148abb2",
        "name": "Love Your Body : A Positive Affirmation Guide for Loving and Appreciating Your Body",
        "searchName": "love your body : a positive affirmation guide for loving and appreciating your body",
        "description": "'Each part of your body will be working perfectly as a harmonious whole. You will even find lines disappearing, weight normalizing, and posture straightening.' -- Louise L. Hay",
        "price": 14,
        "quantity": 46050,
        "evidence": false,
        "discount": 42,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5617/9781561706020.jpg"
        ],
        "categories": [
            "Psychology",
            "Popular Science",
            "Health Books",
            "Popular Psychology",
            "Assertiveness, Motivation & Self-esteem",
            "Mind, Body, Spirit: Thought & Practice"
        ],
        "discountedPrice": 8.12
    },
    {
        "_id": "product",
        "id": "be62e10e-3716-4c0f-aeb8-a438a296f20a",
        "name": "Livin' the Dreem : A Year in My Life",
        "searchName": "livin' the dreem : a year in my life",
        "description": "",
        "price": 13,
        "quantity": 31156,
        "evidence": false,
        "discount": 30,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571274871.jpg"
        ],
        "categories": [
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 9.1
    },
    {
        "_id": "product",
        "id": "24152af5-4b34-47bd-a87b-e9b099c12469",
        "name": "Livin' the Dreem : A Year in the Life of Harry Hill",
        "searchName": "livin' the dreem : a year in the life of harry hill",
        "description": "Harry Hill's unexpurgated diary of his year promises to do for the celebrity memoir what the Hadron Collider has done for particle acceleration. Think Samuel Pepys meets Katie Price. This frank and sometimes controversial diary details one hectic year in the eye of the showbiz storm, cut with a heavy mix of the day-to-day goings on in Bexhill, where Harry lives at home with his mother and occasional Filipino fiance, Lay Dee. Follow the near fatal goings-on during Harry's filming of Britain's \"Most Dangerous Roads\", his attempts to become a judge on \"X Factor\" and his struggle to meet the Welsh chanteuse Duffy at Warwick Avenue. Read of his dog's ongoing battle with the bottle, and how he is sacked from the sniffer staff at Gatwick Airport due to sexual harassment. Learn how Harry's Nan gets on in her holiday home in Iraq, her affair with the milkman and her subsequent struggle to have fun whilst living on a curfew.",
        "price": 20,
        "quantity": 42976,
        "evidence": false,
        "discount": 26,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571272907.jpg"
        ],
        "categories": [
            "TV Tie-in Humour",
            "Parodies & Spoofs"
        ],
        "discountedPrice": 14.8
    },
    {
        "_id": "product",
        "id": "3eedcf9e-bb64-4068-95da-75845905f38e",
        "name": "The Second Machine Age : Work, Progress, and Prosperity in a Time of Brilliant Technologies",
        "searchName": "the second machine age : work, progress, and prosperity in a time of brilliant technologies",
        "description": "In recent years, Google's autonomous cars have logged thousands of miles on American highways and IBM's Watson trounced the best human Jeopardy! players. Digital technologies-with hardware, software, and networks at their core-will in the near future diagnose diseases more accurately than doctors can, apply enormous data sets to transform retailing, and accomplish many tasks once considered uniquely human. In The Second Machine Age MIT's Erik Brynjolfsson and Andrew McAfee-two thinkers at the forefront of their field-reveal the forces driving the reinvention of our lives and our economy. As the full impact of digital technologies is felt, we will realize immense bounty in the form of dazzling personal technology, advanced infrastructure, and near-boundless access to the cultural items that enrich our lives.",
        "price": 16,
        "quantity": 81632,
        "evidence": false,
        "discount": 88,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3932/9780393239355.jpg"
        ],
        "categories": [
            "Social Forecasting, Future Studies",
            "Development Economics",
            "Development Economics",
            "Impact Of Science & Technology On Society",
            "Ethical & Social Aspects Of Computing"
        ],
        "discountedPrice": 1.92
    },
    {
        "_id": "product",
        "id": "a835afb9-1e85-40ff-9e8d-b0b78df23fd1",
        "name": "Breaking Bad Say My Name Badass Best Quotes",
        "searchName": "breaking bad say my name badass best quotes",
        "description": "Revisit the most memorable scenes from Breaking Bad, the multi award-winning series created by Vince Gilligan. The most iconic moments from this thrilling drama are recorded in chronological order using quotes and pictures.",
        "price": 9,
        "quantity": 76004,
        "evidence": false,
        "discount": 19,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7112/9780711236882.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 7.29
    },
    {
        "_id": "product",
        "id": "18c20f6c-de1c-472a-acc0-d1d1199f1e42",
        "name": "Lisa Simpson's Guide to Geek Chic",
        "searchName": "lisa simpson's guide to geek chic",
        "description": "In Lisa Simpson's Guide to Geek Chic, Springfield's most sensitive student reveals the secrets of being a misunderstood geek goddess. Geeks are no longer just those sideshow freaks biting the heads off chickens. Geeks are now freaks about all kinds of other things and are proud to let it show. Geek is now chic, nerdy is now noble, and dorky is now desirable, as they always should have been. The readers, the writers, the scientists, and the creators are now at the top of the heap, and it's time to show the rest of the world what they are made of...beside mostly oxygen, carbon, hydrogen, nitrogen, calcium, and phosphorus, of course. Let your geek flag fly!",
        "price": 3,
        "quantity": 62633,
        "evidence": false,
        "discount": 76,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5930/9780593073032.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.72
    },
    {
        "_id": "product",
        "id": "2cfd1704-efbd-4415-bad6-90c178485410",
        "name": "The History of Medicine: A Very Short Introduction",
        "searchName": "the history of medicine: a very short introduction",
        "description": "Against the backdrop of unprecedented concern for the future of health care, this  Very Short Introduction surveys the history of medicine from classical times to the present. Focussing on the key turning points in the history of Western medicine, such as the advent of hospitals and the rise of experimental medicine, Bill Bynum offers insights into medicine's past, while at the same time engaging with contemporary issues, discoveries, and controversies.",
        "price": 17,
        "quantity": 18592,
        "evidence": false,
        "discount": 73,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/1992/9780199215430.jpg"
        ],
        "categories": [
            "History Of Medicine",
            "History Of Science"
        ],
        "discountedPrice": 4.59
    },
    {
        "_id": "product",
        "id": "7c48f9b7-304a-4b4e-bc4c-b242c8531639",
        "name": "Back to the Front: v.2",
        "searchName": "back to the front: v.2",
        "description": "",
        "price": 11,
        "quantity": 98797,
        "evidence": false,
        "discount": 22,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8605/9781860511226.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 8.58
    },
    {
        "_id": "product",
        "id": "2ae7eeae-29e8-4bf6-8f4c-94d10d4899b0",
        "name": "\"Victoria Wood\"",
        "searchName": "\"victoria wood\"",
        "description": "",
        "price": 13,
        "quantity": 77348,
        "evidence": false,
        "discount": 26,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9061/9781906128067.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 9.62
    },
    {
        "_id": "product",
        "id": "cb284226-06b6-44c8-aa1f-5da0778f33cc",
        "name": "Enlightenment Now : The Case for Reason, Science, Humanism, and Progress",
        "searchName": "enlightenment now : the case for reason, science, humanism, and progress",
        "description": "INSTANT NEW YORK TIMES BESTSELLER",
        "price": 20,
        "quantity": 46460,
        "evidence": false,
        "discount": 30,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5254/9780525427575.jpg"
        ],
        "categories": [
            "Violence In Society",
            "Social, Group Or Collective Psychology",
            "Philosophy Of Science"
        ],
        "discountedPrice": 14
    },
    {
        "_id": "product",
        "id": "7d006a78-634b-46ba-9c70-9021e6c75ea3",
        "name": "\"Yes Minister\"",
        "searchName": "\"yes minister\"",
        "description": "",
        "price": 11,
        "quantity": 82878,
        "evidence": false,
        "discount": 65,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9061/9781906128128.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 3.85
    },
    {
        "_id": "product",
        "id": "63f42edc-75d0-4b37-a7c8-a4c8dcd9ce22",
        "name": "The \"Fast Show\"",
        "searchName": "the \"fast show\"",
        "description": "",
        "price": 16,
        "quantity": 74564,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9061/9781906128081.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 12.64
    },
    {
        "_id": "product",
        "id": "d5a3f50e-3f60-410c-ba0a-d79a1214b648",
        "name": "The Changing Mind : A Neuroscientist's Guide to Ageing Well",
        "searchName": "the changing mind : a neuroscientist's guide to ageing well",
        "description": "THE NEW YORK TIMES BESTSELLER ** THE SUNDAY TIMES BESTSELLER",
        "price": 6,
        "quantity": 88080,
        "evidence": false,
        "discount": 92,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/2413/9780241379394.jpg"
        ],
        "categories": [
            "Age Groups",
            "Sociology: Death & Dying",
            "Employment & Unemployment",
            "Employment & Unemployment",
            "Birth Control, Contraception, Family Planning",
            "Impact Of Science & Technology On Society",
            "Popular Science",
            "Life Sciences: General Issues",
            "Nanotechnology",
            "Coping With Old Age",
            "Mind, Body, Spirit: Thought & Practice"
        ],
        "discountedPrice": 0.48
    },
    {
        "_id": "product",
        "id": "518209bc-f3cf-4f51-b885-d2010b333963",
        "name": "\"Have I Got News for You\"",
        "searchName": "\"have i got news for you\"",
        "description": "This compilation includes the best of Angus Deaton's last two series as chairman, plus the best of the Autumn 2002 and Spring 2003 series - in which the chairman's post was taken by a number of celebrity guests.",
        "price": 11,
        "quantity": 98104,
        "evidence": false,
        "discount": 99,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5634/9780563496243.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.11
    },
    {
        "_id": "product",
        "id": "b5f0d856-9bbb-4d43-b1e7-b74126f5d914",
        "name": "Little Britain:Best Of TV Series 3",
        "searchName": "little britain:best of tv series 3",
        "description": "Bubbles is back! But has she met her match with arch-enemy Desiree? In this battle of the bulge, who'll come out on top? Dudley's Thai mail-order bride arrives, but can he get to grips with Ting Tong? Anne appears on Stars in Their Eyes, hosted by Cat Deeley. What will she sing? `Tonight, Matthew, I'm going to be Celine Dion...'   Highlights from the third TV series also include Lou and Andy getting into an awful kerfuffle over boob jobs and slow-drying patios, the Prime Minister and Sebastian exchanging favours, Dafydd canvassing support in the local Bi Elections, and Emily and Florence going on their (very small) hen night.   Hold the front page! Vicky Pollard has some scandal for the press (for a price) and Marjorie Dawes finally apologises to her FatFighters. By the way, computer still says `No'...   Created and performed by comic sensations Matt Lucas and David Walliams, and including Tom Baker's insightful narration, this must-see TV series is now a must-hear.   Guest stars include Anthony Head, Nigel Havers, Rob Brydon, Imelda Staunton, Richard Madeley, Judy Finnigan and Ruth Madoc.",
        "price": 13,
        "quantity": 41377,
        "evidence": false,
        "discount": 61,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5635/9780563504283.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Radio",
            "Radio",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.07
    },
    {
        "_id": "product",
        "id": "d7ddf6ac-f3a7-4041-a3ee-f5925b008ebe",
        "name": "The Ascent Of Man",
        "searchName": "the ascent of man",
        "description": "Dr Jacob Bronowksi's The Ascent of Man traces the development of human society through our understanding of science.",
        "price": 1,
        "quantity": 70849,
        "evidence": false,
        "discount": 34,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8499/9781849901154.jpg"
        ],
        "categories": [
            "Social & Cultural History",
            "Popular Culture",
            "Social & Cultural Anthropology",
            "Philosophy Of Science",
            "History Of Science",
            "Popular Science",
            "Biology, Life Sciences",
            "Evolution",
            "Natural History Books"
        ],
        "discountedPrice": 0.66
    },
    {
        "_id": "product",
        "id": "0e1c0ade-8431-4ab0-85f8-1772e96a0783",
        "name": "Complexity : A Guided Tour",
        "searchName": "complexity : a guided tour",
        "description": "What enables individually simple insects like ants to act with such precision and purpose as a group? How do trillions of neurons produce something as extraordinarily complex as consciousness? In this remarkably clear and companionable book, leading complex systems scientist Melanie Mitchell provides an intimate tour of the sciences of complexity, a broad set of efforts that seek to explain how large-scale complex, organized, and adaptive behavior can emerge from",
        "price": 20,
        "quantity": 37297,
        "evidence": false,
        "discount": 5,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/1997/9780199798100.jpg"
        ],
        "categories": [
            "Cybernetics & Systems Theory",
            "Mathematics",
            "History Of Science",
            "Popular Science"
        ],
        "discountedPrice": 19
    },
    {
        "_id": "product",
        "id": "fcffd165-9da4-4672-b561-3843c7df8d41",
        "name": "10 Wonderful Years",
        "searchName": "10 wonderful years",
        "description": "",
        "price": 12,
        "quantity": 53005,
        "evidence": false,
        "discount": 24,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/6202/9780620292481.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 9.12
    },
    {
        "_id": "product",
        "id": "cfecf8f1-d4cf-4c7b-9c2f-051498562c5f",
        "name": "The Call of the Weird : Travels in American Subcultures",
        "searchName": "the call of the weird : travels in american subcultures",
        "description": "For ten years Louis Theroux has been making programmes about off-beat characters on the fringes of US society. Now he revisits America and the people who have most fascinated him to try to discover what motivates them, why they believe the things they believe, and to find out what has happened to them since he last saw them. Along the way Louis thinks about what drives him to spend so much time among weird people, and considers whether he's learned anything about himself in the course of ten years working with them. Has he manipulated the people he's interviewed, or have they manipulated him? From his Las Vegas base, Louis revisits the assorted dreamers and outlaws who have been his TV feeding ground. Attempting to understand a little about himself and the workings of his own mind, Louis considers questions such as: What is the difference between pathology and 'normal' weirdness? Is there something particularly weird about Americans? What does it mean to be weird, or 'to be yourself'? And do we choose our beliefs or do our beliefs choose us?",
        "price": 11,
        "quantity": 60068,
        "evidence": false,
        "discount": 8,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4050/9781405091848.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Literary Essays",
            "Reportage & Collected Journalism",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Guidebooks",
            "Travel Writing"
        ],
        "discountedPrice": 10.12
    },
    {
        "_id": "product",
        "id": "567dc66e-cb49-4d73-a593-4d1ee05e173d",
        "name": "Missing Microbes : How Killing Bacteria Creates Modern Plagues",
        "searchName": "missing microbes : how killing bacteria creates modern plagues",
        "description": "A clarion call to save humanity's most essential fellow creatures - and our health",
        "price": 4,
        "quantity": 42349,
        "evidence": false,
        "discount": 34,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7807/9781780746883.jpg"
        ],
        "categories": [
            "Popular Science",
            "Microbiology (non-medical)",
            "Health Books"
        ],
        "discountedPrice": 2.64
    },
    {
        "_id": "product",
        "id": "b1c6c888-a973-477f-99d1-8d585304b193",
        "name": "Fawlty Towers : Second Sitting",
        "searchName": "fawlty towers : second sitting",
        "description": "John Cleese, Prunella Scales, Connie Booth and Andrew Sachs star in two BBC TV episodes, 'The Rat' and 'The Builders'.   In 'The Rat', the hotel faces closure due to lack of cleanliness - and two dead `pig-ee-ons' in the watertank. Basil, Sybil and the staff have until the health inspector returns tomorrow to sort out all the problems. First, Basil has to get rid of Manuel's `hamster'.  Basil and Sybil have the weekend off in 'The Builders' and leave Polly in charge. But, it's O'Reilly's men that are coming and Polly goes upstairs for a siesta. Which leaves Manuel in charge...   Vintage Beeb: classic albums first available as BBC LPs, now on CD for the first time ever.   This recording was previously released on LP in 1981.",
        "price": 4,
        "quantity": 67644,
        "evidence": false,
        "discount": 23,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4084/9781408409862.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Children's General Story Books",
            "Television & Film"
        ],
        "discountedPrice": 3.08
    },
    {
        "_id": "product",
        "id": "4f12da3b-31a5-4d57-8bd8-1500ceac8698",
        "name": "Fawlty Towers Series 1",
        "searchName": "fawlty towers series 1",
        "description": "Fawlty Towers is one of the nation's favourite sitcoms, consistently topping polls to find the best comedy show ever. Though only twelve episodes were ever made, each one is a comic masterpiece.   In these six episodes, incompetent hotelier Basil Fawlty strives for success but is continually foiled at every turn. In 'A Touch of Class', he tries to attract a better class of hotel guest; while in 'The Builders', he hires O'Reilly's men to carry out some maintenance - but is the cheapest option really the best? In 'The Wedding Party', he suspects hanky panky when an unmarried couple request a double room; and in 'The Hotel Inspectors', Basil is horrified when he realises he needs to be polite to the guests in case one of them is an undercover inspector. 'Gourmet Night' sees him organising an evening of fine dining - but will new chef Kurt be able to cope? And in 'The Germans', Basil struggles not to cause offence to a party of German guests. As long as he doesn't mention the war...   John Cleese stars as Basil Fawlty, with Prunella Scales as Sybil, Connie Booth as Polly and Andrew Sachs as Manuel.",
        "price": 18,
        "quantity": 31650,
        "evidence": false,
        "discount": 11,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4084/9781408440971.jpg"
        ],
        "categories": [
            "Celebrity Biographies & Books",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 16.02
    },
    {
        "_id": "product",
        "id": "c0a75c10-2dd3-44cc-9e51-059d3cf3c76a",
        "name": "How We Became Posthuman : Virtual Bodies in Cybernetics, Literature, and Informatics",
        "searchName": "how we became posthuman : virtual bodies in cybernetics, literature, and informatics",
        "description": "Separating hype from fact, this text investigates the fate of embodiment in the information age. It relates three interwoven stories: how information lost its body, that is, how it came to be conceptualized as an entity separate from the material forms that carry it; the cultural and technological constuction of the cyborg; and the dismantling of the humanist \"subject\" in cybernetic discourse, along with the emergence of the \"posthuman\". Ranging across the history of technology, cultural studies and literary criticism, the text shows what had erased, forgotten, and elided to conceive of information as a disembodied entity. The author moves from the post-World War II Macy Conferences on cybernetics to the 1952 novel \"Limbo\" by Bernard Wolfe; from the concept of self-making to Philip K. Dick's literary explorations of hallucination and reality; and from artificial life to postmodern novels exploring the implications of seeing humans as cybernetic systems.",
        "price": 1,
        "quantity": 34623,
        "evidence": false,
        "discount": 64,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/2263/9780226321462.jpg"
        ],
        "categories": [
            "Cybernetics & Systems Theory",
            "Science: General Issues",
            "Philosophy Of Science",
            "History Of Science",
            "Ethical & Social Aspects Of Computing",
            "Computer Science",
            "Virtual Reality"
        ],
        "discountedPrice": 0.36
    },
    {
        "_id": "product",
        "id": "0e84b77a-d3a7-4488-a624-6d3fe43a8785",
        "name": "The \"League of Gentlemen\"",
        "searchName": "the \"league of gentlemen\"",
        "description": "",
        "price": 10,
        "quantity": 38085,
        "evidence": false,
        "discount": 92,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9061/9781906128098.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.8
    },
    {
        "_id": "product",
        "id": "2d21b897-3325-40a6-aa45-9f3850088ebd",
        "name": "The Morecambe and Wise Quiz Book",
        "searchName": "the morecambe and wise quiz book",
        "description": "Despite no-longer being with us, Morecambe & Wise continue to be a much-loved comedy double act who, thanks to regular repeats of their TV work, continue to generate laughs from fans both old and new. The Morecambe & Wise Quiz Book gives people of all ages the chance to indulge themselves in all things related to Eric and Ernie. Both men may have danced into the sunset, but their legacy, created by the brilliance of their partnership, will live on forever and this new book not only pays tribute to them, but firmly tests a fan's knowledge. Featuring 1,000 questions, the book takes us on a quiz journey through Eric and Ernie's various stage, film, TV and radio credits. Along the way, the text pauses to allow the reader to enjoy a selection of recollections from those who worked with the duo both in-front and behind the scenes, as well as providing fascinating facts and figures connected with the double act. Dedicated to the late comedians, this new quiz book will bring you sunshine on a rainy afternoon and make you smile as you recall the laughter that Morecambe & Wise brought the nation.",
        "price": 19,
        "quantity": 67931,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9062/9781906217747.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.89
    },
    {
        "_id": "product",
        "id": "6d757f01-7782-47b7-9d74-6f9984e910b4",
        "name": "The Gendered Brain : The new neuroscience that shatters the myth of the female brain",
        "searchName": "the gendered brain : the new neuroscience that shatters the myth of the female brain",
        "description": "Barbie or Lego? Reading maps or reading emotions? Do you have a female brain or a male brain? Or is that the wrong question?",
        "price": 9,
        "quantity": 13935,
        "evidence": false,
        "discount": 87,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7847/9781784706814.jpg"
        ],
        "categories": [
            "Gender Studies, Gender Groups",
            "Gender Studies: Women",
            "Psychology Of Gender",
            "Popular Science",
            "Neurosciences"
        ],
        "discountedPrice": 1.17
    },
    {
        "_id": "product",
        "id": "65e94b41-26f2-4f5c-98f8-e8b509895340",
        "name": "Lasted Yet Another Year",
        "searchName": "lasted yet another year",
        "description": "Comedian, broadcaster, and writer Steve N Allen takes a look at the news in a different way",
        "price": 12,
        "quantity": 38365,
        "evidence": false,
        "discount": 96,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9134/9781913408619.jpg"
        ],
        "categories": [
            "Contemporary Fiction",
            "TV Tie-in Humour",
            "Parodies & Spoofs",
            "Humour Collections & Anthologies"
        ],
        "discountedPrice": 0.48
    },
    {
        "_id": "product",
        "id": "c86cb514-487d-41e7-85fe-d17988e4261d",
        "name": "You Bantering Me? : The life story of Love Island's biggest star",
        "searchName": "you bantering me? : the life story of love island's biggest star",
        "description": "With the nation gripped by Love Island fever, the show's most popular contestant ever shares his unique take on the world in a book that will be hilarious, endearing, heartfelt and as lovable as its author.",
        "price": 9,
        "quantity": 23616,
        "evidence": false,
        "discount": 70,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4736/9781473688599.jpg"
        ],
        "categories": [
            "Autobiography: Arts & Entertainment",
            "TV & Society",
            "Dating, Relationships, Living Together & Marriage",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 2.7
    },
    {
        "_id": "product",
        "id": "2e32285d-f84d-46d2-86ac-0140ff65ac7d",
        "name": "Making Sense : Conversations on Consciousness, Morality and the Future of Humanity",
        "searchName": "making sense : conversations on consciousness, morality and the future of humanity",
        "description": "\"Civilization rests on a series of successful conversations.\" -Sam Harris",
        "price": 5,
        "quantity": 47423,
        "evidence": false,
        "discount": 28,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7876/9781787630420.jpg"
        ],
        "categories": [
            "Ethics & Moral Philosophy",
            "Ethical Issues & Debates",
            "Impact Of Science & Technology On Society"
        ],
        "discountedPrice": 3.6
    },
    {
        "_id": "product",
        "id": "59a1f4cb-091f-41d5-9709-eacddd758565",
        "name": "Through it All I've Always Laughed : Memoirs of Count Arthur Strong",
        "searchName": "through it all i've always laughed : memoirs of count arthur strong",
        "description": "Count Arthur Strong tells the story of his extraordinary journey from his humble early years as the only son of a contortionist in wartime Doncaster to the dizzy heights and excesses of fame as one of the shining lights of popular entertainment. Count Arthur Strong is a show business legend, after-dinner speaker and a leading authority on Ancient Egypt, having been stationed there during his nation service. He has countless friends in the showbiz world. People like Barry Cryer, the white haired one with glasses off 'I'm Sorry I Haven't Got A Clue' and 'Jokers Wild'. This is his first volume, of what he believes may be a 6 volume collection, of his memoirs. He has a few select dates still available for anything (except window cleaning) and is represented, (if you can call it that) by Richard Daws at Komedia Entertainment. (Or if you want to go directly through me and pay cash, I can do that as well.) (In fact I prefer that.) Thank you.",
        "price": 20,
        "quantity": 77494,
        "evidence": false,
        "discount": 10,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5713/9780571314881.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 18
    },
    {
        "_id": "product",
        "id": "1df9512e-50b1-4822-8896-0d657e6fbdf7",
        "name": "Blackadder: The Complete Collected Series",
        "searchName": "blackadder: the complete collected series",
        "description": "The complete soundtracks of all four Blackadder TV series plus over 3 hours of specials and extras, including previously unreleased material.",
        "price": 4,
        "quantity": 36300,
        "evidence": false,
        "discount": 71,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9102/9781910281529.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "Radio",
            "Radio",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 1.16
    },
    {
        "_id": "product",
        "id": "1e6cc712-437f-4e5c-9a78-8f2dda1b0181",
        "name": "What a Plant Knows : A Field Guide to the Senses of Your Garden - and Beyond",
        "searchName": "what a plant knows : a field guide to the senses of your garden - and beyond",
        "description": "How does a Venus flytrap know when to snap shut? Can an orchid get jet lag? Does a tomato plant feel pain when you pluck a fruit from its vines? And does your favourite fern care whether you play Bach or the Beatles? Combining cutting-edge research with lively storytelling, biologist Daniel Chamovitz explores how plants experience our shared Earth - through sight, smell, touch, hearing, memory, and even awareness. Whether you are a green thumb, a science buff, a vegetarian, or simply a nature lover, this rare inside look at the life of plants will surprise and delight.",
        "price": 10,
        "quantity": 4167,
        "evidence": false,
        "discount": 80,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8516/9781851689705.jpg"
        ],
        "categories": [
            "Popular Science",
            "Life Sciences: General Issues",
            "Botany & Plant Sciences",
            "Trees, Wildflowers & Plants"
        ],
        "discountedPrice": 2
    },
    {
        "_id": "product",
        "id": "47e20c63-33c7-4233-abc0-9087622f757f",
        "name": "The Ricky Gervais Podcast Guide to Natural History",
        "searchName": "the ricky gervais podcast guide to natural history",
        "description": "",
        "price": 6,
        "quantity": 45527,
        "evidence": false,
        "discount": 34,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8605/9781860513480.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 3.96
    },
    {
        "_id": "product",
        "id": "7edc3b16-152f-4688-90ef-10ba4ecd6b4e",
        "name": "Mock the Week: 2 : Too Hot for TV 2",
        "searchName": "mock the week: 2 : too hot for tv 2",
        "description": "",
        "price": 17,
        "quantity": 78237,
        "evidence": false,
        "discount": 59,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8605/9781860513299.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 6.97
    },
    {
        "_id": "product",
        "id": "ff2c10a6-fdc4-479f-baeb-184646ccbed8",
        "name": "Why? : Answers to everyday scientific questions",
        "searchName": "why? : answers to everyday scientific questions",
        "description": "Why?: Scientific Answers to Fundamental Questions sets out to provide simple answers to the most fundamental questions about the world. Asking why is the sky blue? Why is water wet? Why do we need sleep? Why are there 24 hours in a day? Why is light faster than sound?, this book gets to grips with concepts that appear so basic and everyday, yet we struggle to find an answer for.   For each question the author provides a simple, single line answer followed by more in-depth information that casts light onto the murkiest of scientific questions. The book covers the whole lot: physics, biology, chemistry, geology, geography, meteorology, palaeontology and planetary science, with over 50 fundamental questions answered, allowing you to wow friends and family alike with smart answers to the obvious questions they never thought to ask.",
        "price": 13,
        "quantity": 98079,
        "evidence": false,
        "discount": 3,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8431/9781843179511.jpg"
        ],
        "categories": [
            "Popular Science",
            "Biology, Life Sciences",
            "Geology & The Lithosphere"
        ],
        "discountedPrice": 12.61
    },
    {
        "_id": "product",
        "id": "248758aa-6f4b-4a9c-909d-5d9165544137",
        "name": "Up to the Hilt",
        "searchName": "up to the hilt",
        "description": "",
        "price": 18,
        "quantity": 9413,
        "evidence": false,
        "discount": 72,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8978/9781897861035.jpg"
        ],
        "categories": [
            "Dance & Other Performing Arts",
            "Dance & Other Performing Arts",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 5.04
    },
    {
        "_id": "product",
        "id": "03789cf8-d3e8-41b0-a3ad-a597a271ecc9",
        "name": "The Shameless Guide to Life",
        "searchName": "the shameless guide to life",
        "description": "Paul Abbott's \"Shameless\" has consistently been the best thing on television since it started on Channel 4 in 2004. Fearless, controversial and downright hilarious, it goes where other popular dramas fear to tread. Then, it necks a couple of pills, washes them down with several pints of lager and carries on until it falls over. Now, the Gallaghers and friends (and enemies) have put pen to paper to bring you the ultimate lifestyle guide. Frank passes on his unique thoughts about the trials of parenting. Sheila gets down and dirty with How Clean is Your Council House? Debbie shares some of her favourite recipes and nutritional tips in a \"Shameless\" version of \"You Are What You Eat\". Ian gives us his gay guide to the Chatsworth Estate. And, of course, the Gallaghers together share their knowledge of how to throw a great party...Award-winning writer Paul Abbott has created the perfect companion to one of Britain's best loved dramas. If you can't get enough of the Chatworth Estate's favourite family, this is the book for you.",
        "price": 18,
        "quantity": 34465,
        "evidence": false,
        "discount": 41,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9050/9781905026364.jpg"
        ],
        "categories": [
            "Television",
            "Television",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 10.62
    },
    {
        "_id": "product",
        "id": "bc82a1f4-9328-471c-aca7-ccd095e964af",
        "name": "Hacking Darwin : Genetic Engineering and the Future of Humanity",
        "searchName": "hacking darwin : genetic engineering and the future of humanity",
        "description": "\"A gifted and thoughtful writer, Metzl brings us to the frontiers of biology and technology, and reveals a world full of promise and peril.\" --Siddhartha Mukherjee MD, New York Times bestselling author of The Emperor of All Maladies and The Gene",
        "price": 6,
        "quantity": 38476,
        "evidence": false,
        "discount": 80,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7282/9781728214139.jpg"
        ],
        "categories": [
            "Social Forecasting, Future Studies",
            "Ethical Issues: Scientific & Technological Developments",
            "Science & Geography",
            "Impact Of Science & Technology On Society",
            "Life Sciences: General Issues",
            "Evolution",
            "Genetics (non-medical)"
        ],
        "discountedPrice": 1.2
    },
    {
        "_id": "product",
        "id": "b2074056-3f55-489f-bccd-a9472641b9d1",
        "name": "Hancock : The Economy Drive, the Emigrant and Two Other TV Episodes",
        "searchName": "hancock : the economy drive, the emigrant and two other tv episodes",
        "description": "Tony Hancock stars in four more specially selected BBC TV episodes: \"The Economy Drive\" - 25 September 1959; \"The Cold\" - 4 March 1960; \"The Emigrant\" - 18 March 1960; \"The Baby Sitters\" - 8 April 1960. Once again, Tony Hancock stars as the loveable curmudgeon, in four original television soundtracks written by the character's creators, Ray Galton and Alan Simpson. In \"The Economy Drive\", Hancock returns home from holiday to find that Sid has left the TV and all the lights on, and failed to cancel the milk and the papers. It's time to make some cutbacks, while \"The Cold\" sees Hancock trying to find a cure for a winter cold, but not even his doctor can help. In \"The Emigrant\", Hancock decides he's had enough of England, and decides to emigrate - even though none of the colonies seem keen to have him, while \"The Baby Sitters\" finds Hancock and Sid employed as baby sitters in a plush, modern house with all the gadgets. But after raiding the host's larder and drinks cabinet the two of them fall asleep. Only when the parents return do they realise there's been a burglary...Featuring a cast including Sid James, Arthur Mullard and John Le Mesurier, these four episodes show the master of misery at his very best.",
        "price": 9,
        "quantity": 10478,
        "evidence": false,
        "discount": 16,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5635/9780563504603.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 7.56
    },
    {
        "_id": "product",
        "id": "ef244d8a-e408-4d65-ab91-72c228d2eb60",
        "name": "\"Little Britain\"... on Radio",
        "searchName": "\"little britain\"... on radio",
        "description": "Matt and David haven't forgotten \"Little Britain's\" origins on BBC Radio 4 and, using their own personal archive, they have helped compile this special, limited edition tin. This tin contains the complete radio series - plus the pilot show - an exclusive interview with Matt Lucas and David Walliams, a 60-minute special about the inspiration behind \"Little Britain\", and a unique full-length DVD featuring behind-the-scenes footage. The Complete Radio Series - All 8 episodes from Series 1 and Series 2, plus pilot episode, never-broadcast sketches and outtakes. The Story of \"Little Britain CD\" - An extended, exclusive interview with Matt Lucas and David Walliams about the origins of the \"Little Britain\" radio series; rare audio clips from the pilot shows, 'Sir Bernard Chumley's Soiree' and 'Make a Difference...with Lucas and Walliams'; narrated by Anthony Head. \"Little Britain\" on Radio DVD - This is an exclusive full-length DVD, with behind-the-scenes footage from two live recording sessions of the radio series. It has a specially-recorded introduction by Matt and David.",
        "price": 10,
        "quantity": 36901,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5635/9780563504146.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 3.1
    },
    {
        "_id": "product",
        "id": "897d238a-ea6f-434d-ad87-5723137247a6",
        "name": "Introduction to Research Methods 5th Edition : A Practical Guide for Anyone Undertaking a Research Project",
        "searchName": "introduction to research methods 5th edition : a practical guide for anyone undertaking a research project",
        "description": "Introduction to Research Methods contains everything from developing an initial idea into a proposal, through to analysing data and reporting results. Whether you have to undertake a project as part of your coursework, or as part of your employment, or simply because you are fascinated by something you have observed and want to find out more, this book offers you advice on how to turn your ideas into a workable project. Specifically it will show you how to:",
        "price": 11,
        "quantity": 15936,
        "evidence": false,
        "discount": 76,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4087/9781408711057.jpg"
        ],
        "categories": [
            "Research Methods: General",
            "Science: General Issues"
        ],
        "discountedPrice": 2.64
    },
    {
        "_id": "product",
        "id": "356a7d09-af80-4ed6-9afb-3c6164a50345",
        "name": "All Aboard the Hogwarts Express!",
        "searchName": "all aboard the hogwarts express!",
        "description": "Learn all about the Hogwarts Express and the key moments thattook",
        "price": 17,
        "quantity": 49208,
        "evidence": false,
        "discount": 1,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4071/9781407198811.jpg"
        ],
        "categories": [
            "TV Tie-in Humour",
            "Characters",
            "Children's Fiction",
            "Children's General Story Books",
            "Adventure Books for Kids",
            "Sci Fi Books for Kids",
            "Fantasy Books for Kids",
            "Drama",
            "Television & Film",
            "General Knowledge",
            "Handicrafts",
            "Children's Hobby & Gaming Books",
            "Puzzle Books",
            "Witches & Ghosts (Children's/YA)"
        ],
        "discountedPrice": 16.83
    },
    {
        "_id": "product",
        "id": "ec1542f5-b709-4092-8749-6e145c5d539d",
        "name": "The Walmington-on-Sea Home Guard Training Manual : As Used by Dad's Army",
        "searchName": "the walmington-on-sea home guard training manual : as used by dad's army",
        "description": "A facsimile of the Walmington-on-Sea Home Guard Training Manual recently discovered in the attic of a house in the town. Found in a trunk amongst a pile of Hotspur comics, it belonged to Private Pike and features his handwritten marginal notes on the text plus his personal jottings on matters of rather less importance than the defence of the realm, such as films he has seen, girls he has dated and the progress of Aston Villa FC. The book bears the official crest and stamp of the Queen's Own Royal West Kent Regiment, to which the platoon belongs. Although aged and covered with stains, boot prints, tears and scorch marks, it is in a reasonable condition for facsimile printing. The manual is Capt Mainwaring's attempt to ready the platoon to face (and recognize) the enemy in the coming invasion of Britain.",
        "price": 8,
        "quantity": 18487,
        "evidence": false,
        "discount": 23,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/2978/9780297865834.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 6.16
    },
    {
        "_id": "product",
        "id": "6014206f-d4cd-4ffa-940a-c5eab371202b",
        "name": "Introduction to Meta-Analysis",
        "searchName": "introduction to meta-analysis",
        "description": "This book provides a clear and thorough introduction to meta-analysis, the process of synthesizing data from a series of separate studies. Meta-analysis has become a critically important tool in fields as diverse as medicine, pharmacology, epidemiology, education, psychology, business, and ecology.  Introduction to Meta-Analysis :  Outlines the role of meta-analysis in the research process Shows how to compute effects sizes and treatment effects Explains the fixed-effect and random-effects models for synthesizing data Demonstrates how to assess and interpret variation in effect size across studies Clarifies concepts using text and figures, followed by formulas and examples Explains how to avoid common mistakes in meta-analysis Discusses controversies in meta-analysis Features a web site with additional material and exercises A superb combination of lucid prose and informative graphics, written by four of the world's leading experts on all aspects of meta-analysis. Borenstein, Hedges, Higgins, and Rothstein provide a refreshing departure from cookbook approaches with their clear explanations of the what and why of meta-analysis.",
        "price": 8,
        "quantity": 2378,
        "evidence": false,
        "discount": 99,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4700/9780470057247.jpg"
        ],
        "categories": [
            "Medicine",
            "Medical Research",
            "Epidemiology & Medical Statistics",
            "Clinical & Internal Medicine",
            "Mathematics",
            "Probability & Statistics",
            "Science: General Issues"
        ],
        "discountedPrice": 0.08
    },
    {
        "_id": "product",
        "id": "eff553ad-5dff-49b4-9414-a4daa32de9d3",
        "name": "The Hanna-Barbera Guide to Life : Cool Tips for Top Cats",
        "searchName": "the hanna-barbera guide to life : cool tips for top cats",
        "description": "A humorous and playful gift book from the Hanna-Barbera stable. Everything you need to know about making the most of life. The Hanna-Barbera Guide to Life is a humorous guide to living, featuring advice, anecdotes and wisdom from the slapstick world of Hanna-Barbera's cartoon characters - ideal for those seeking for the deeper meaning to life (sort of). Suitable for fans of the classic Hanna-Barbera cartoons - whether it's The Jetsons, Wacky Races, Yogi Bear, Penelope Pitstop or The Flintstones. This laugh-aloud gift book helps to bring back the glory days of cartoons for readers of all ages.",
        "price": 15,
        "quantity": 38447,
        "evidence": false,
        "discount": 32,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4052/9781405248594.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 10.2
    },
    {
        "_id": "product",
        "id": "3d16a877-4d36-431f-955e-09db6ac54e27",
        "name": "Feng Shaun",
        "searchName": "feng shaun",
        "description": "",
        "price": 15,
        "quantity": 85942,
        "evidence": false,
        "discount": 90,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4052/9781405244497.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 1.5
    },
    {
        "_id": "product",
        "id": "6f8e6a90-bb3a-447c-a088-462a3a6b591f",
        "name": "Probability Theory : The Logic of Science",
        "searchName": "probability theory : the logic of science",
        "description": "The standard rules of probability can be interpreted as uniquely valid principles in logic. In this book, E. T. Jaynes dispels the imaginary distinction between 'probability theory' and 'statistical inference', leaving a logical unity and simplicity, which provides greater technical power and flexibility in applications. This book goes beyond the conventional mathematics of probability theory, viewing the subject in a wider context. New results are discussed, along with applications of probability theory to a wide variety of problems in physics, mathematics, economics, chemistry and biology. It contains many exercises and problems, and is suitable for use as a textbook on graduate level courses involving data analysis. The material is aimed at readers who are already familiar with applied mathematics at an advanced undergraduate level or higher. The book will be of interest to scientists working in any area where inference from incomplete information is necessary.",
        "price": 10,
        "quantity": 56503,
        "evidence": false,
        "discount": 93,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5215/9780521592710.jpg"
        ],
        "categories": [
            "Probability & Statistics",
            "Maths For Scientists",
            "Physics Books",
            "Mathematical Physics",
            "Maths For Engineers"
        ],
        "discountedPrice": 0.7
    },
    {
        "_id": "product",
        "id": "78583f02-1040-4785-913f-d784eccbfd08",
        "name": "\"Porridge\"",
        "searchName": "\"porridge\"",
        "description": "Double CD. Running time: 2hrs. Four episodes from the long-running BBC prison comedy.",
        "price": 18,
        "quantity": 14059,
        "evidence": false,
        "discount": 19,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5634/9780563495062.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 14.58
    },
    {
        "_id": "product",
        "id": "52fdd1c6-c17b-4114-b64f-a2b34b967083",
        "name": "Dinnerladies: Four Original BBC Television Episodes No.2",
        "searchName": "dinnerladies: four original bbc television episodes no.2",
        "description": "Episodes from the second series of the BBC TV comedy set in a factory canteen.",
        "price": 5,
        "quantity": 51422,
        "evidence": false,
        "discount": 85,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5635/9780563535164.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.75
    },
    {
        "_id": "product",
        "id": "d09f57fd-fcb8-41a2-94e0-b4cd5e6249c1",
        "name": "The Question Concerning Technology in China : An Essay in Cosmotechnics",
        "searchName": "the question concerning technology in china : an essay in cosmotechnics",
        "description": "A systematic historical survey of Chinese thought is followed by an investigation of the historical-metaphysical questions of modern technology, asking how Chinese thought might contribute to a renewed questioning of globalized technics.",
        "price": 13,
        "quantity": 43445,
        "evidence": false,
        "discount": 92,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9954/9780995455009.jpg"
        ],
        "categories": [
            "Deconstructionism, Structuralism, Post-structuralism",
            "Oriental & Indian Philosophy",
            "Philosophy: Metaphysics & Ontology",
            "Impact Of Science & Technology On Society"
        ],
        "discountedPrice": 1.04
    },
    {
        "_id": "product",
        "id": "8299eaa7-aaaa-466b-a3ac-98adf5d3808b",
        "name": "Official Family Guy Calendar 2012",
        "searchName": "official family guy calendar 2012",
        "description": "",
        "price": 1,
        "quantity": 40581,
        "evidence": false,
        "discount": 95,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8477/9781847708632.jpg"
        ],
        "categories": [
            "Cartoons & Comic Strips",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 0.05
    },
    {
        "_id": "product",
        "id": "ad86c513-b041-48e4-a4c4-d3d0ef5acf0a",
        "name": "Official Come Fly With Me Calendar 2012",
        "searchName": "official come fly with me calendar 2012",
        "description": "",
        "price": 12,
        "quantity": 55915,
        "evidence": false,
        "discount": 60,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8477/9781847709059.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 4.8
    },
    {
        "_id": "product",
        "id": "8325dd48-6b00-46a6-ab1a-e8cbf6048809",
        "name": "The Thirteen Books of the Elements, Vol. 3",
        "searchName": "the thirteen books of the elements, vol. 3",
        "description": "This is the definitive edition of one of the very greatest classics of all time--the full Euclid, not an abridgement. Utilizing the text established by Heiberg, Sir Thomas Heath encompasses almost 2500 years of mathematical and historical study upon Euclid.",
        "price": 7,
        "quantity": 11474,
        "evidence": false,
        "discount": 72,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4866/9780486600901.jpg"
        ],
        "categories": [
            "Mathematical Foundations",
            "Geometry",
            "History Of Mathematics",
            "History Of Science"
        ],
        "discountedPrice": 1.96
    },
    {
        "_id": "product",
        "id": "cc3ec15d-71a9-4417-9f9d-32e6a869f00a",
        "name": "Morecambe and Wise: The Lost Tapes",
        "searchName": "morecambe and wise: the lost tapes",
        "description": "Only one episode from Series One of The Morecambe and Wise Show still exists in the BBC archive. However, thanks to home recordings made by TV viewers at the time, it is now possible to listen to soundtracks from all seven of the 'lost' episodes.",
        "price": 13,
        "quantity": 56933,
        "evidence": false,
        "discount": 1,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4458/9781445851228.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 12.87
    },
    {
        "_id": "product",
        "id": "bd4e91b7-a787-4c45-8e9c-5216db7105f0",
        "name": "Back To The Front : Carrott Collection",
        "searchName": "back to the front : carrott collection",
        "description": "",
        "price": 10,
        "quantity": 94823,
        "evidence": false,
        "discount": 62,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9085/9781908571205.jpg"
        ],
        "categories": [
            "TV Tie-in Humour"
        ],
        "discountedPrice": 3.8
    },
    {
        "_id": "product",
        "id": "0a0d4f04-4232-4d65-a4e6-bf979829f107",
        "name": "A Series of Fortunate Events : Chance and the Making of the Planet, Life, and You",
        "searchName": "a series of fortunate events : chance and the making of the planet, life, and you",
        "description": "\"Fascinating and exhilarating-Sean B. Carroll at his very best.\"-Bill Bryson, author of The Body: A Guide for Occupants",
        "price": 4,
        "quantity": 20125,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/6912/9780691201757.jpg"
        ],
        "categories": [
            "Philosophy Of Science",
            "Popular Science",
            "Biology, Life Sciences",
            "Evolution",
            "Human Biology"
        ],
        "discountedPrice": 3.16
    },
    {
        "_id": "product",
        "id": "61e5183c-3b42-4c98-be66-3d8f4febdedf",
        "name": "A Year At The Circus : Inside Trump's White House",
        "searchName": "a year at the circus : inside trump's white house",
        "description": "Welcome to the White House.",
        "price": 10,
        "quantity": 90903,
        "evidence": false,
        "discount": 80,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7859/9781785944376.jpg"
        ],
        "categories": [
            "Constitution: Government & The State",
            "Central Government",
            "Regional Government",
            "Funny Books & Stories",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 2
    },
    {
        "_id": "product",
        "id": "a6d9a946-5ffe-4504-921c-4cc9d0b97fc2",
        "name": "Dad's Army - A Companion 2018",
        "searchName": "dad's army - a companion 2018",
        "description": "",
        "price": 14,
        "quantity": 26880,
        "evidence": false,
        "discount": 66,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9547/9780954770235.jpg"
        ],
        "categories": [
            "Celebrity Biographies & Books",
            "Dance & Other Performing Arts",
            "Dance & Other Performing Arts",
            "TV Tie-in Humour"
        ],
        "discountedPrice": 4.76
    },
    {
        "_id": "product",
        "id": "4be61568-4e1b-49dc-b1f1-2750ef8cbedc",
        "name": "Cycling down The Street",
        "searchName": "cycling down the street",
        "description": "",
        "price": 5,
        "quantity": 67400,
        "evidence": false,
        "discount": 81,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5272/9781527215566.jpg"
        ],
        "categories": [
            "Television Soap Operas",
            "Television Soap Operas",
            "Funny Books & Stories",
            "TV Tie-in Humour",
            "Cycling",
            "Travel Writing"
        ],
        "discountedPrice": 0.95
    },
    {
        "_id": "product",
        "id": "99421a14-a222-4d59-8b4e-1a59cd073779",
        "name": "The Art of Logic : How to Make Sense in a World that Doesn't",
        "searchName": "the art of logic : how to make sense in a world that doesn't",
        "description": "For thousands of years, mathematicians have used the timeless art of logic to see the world more clearly. In The Art of Logic, Royal Society Science Book Prize nominee Eugenia Cheng shows how anyone can think like a mathematician - and see, argue and think better.",
        "price": 8,
        "quantity": 59455,
        "evidence": false,
        "discount": 46,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7881/9781788160391.jpg"
        ],
        "categories": [
            "Philosophy: Logic",
            "Mathematical Logic",
            "History Of Mathematics",
            "Popular Science"
        ],
        "discountedPrice": 4.32
    },
    {
        "_id": "product",
        "id": "bc8a3341-265e-4ecb-8f55-69b8d9817ce7",
        "name": "Inclusive Education : A Practical Guide to Supporting Diversity in the Classroom",
        "searchName": "inclusive education : a practical guide to supporting diversity in the classroom",
        "description": "Inclusive education continues to be an exciting but challenging component of the everyday life of the classroom teacher. Whist there is no recipe for successful inclusion, meaningful inclusion involves engaging in a flexible process in which educators work in partnership with parents, students, and other professionals in order to meet the needs of all children.",
        "price": 18,
        "quantity": 82676,
        "evidence": false,
        "discount": 72,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/4156/9780415601481.jpg"
        ],
        "categories": [
            "Inclusive Education / Mainstreaming",
            "Inclusive Education / Mainstreaming",
            "Multicultural Education",
            "Multicultural Education",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 5.04
    },
    {
        "_id": "product",
        "id": "763f2551-bb91-43a4-848a-bf2e0a3377be",
        "name": "Not This But That : No More Teaching a Letter a Week",
        "searchName": "not this but that : no more teaching a letter a week",
        "description": "Letter-a-week may be a ubiquitous approach to teaching alphabet knowledge, but that doesn't mean it's an effective one. In No More Teaching a Letter a Week, early literacy researcher Dr. William Teale helps us understand that alphabet knowledge is more than letter recognition, and identifies research-based principles of effective alphabet instruction, which constitutes the foundation for phonics teaching and learning. Literacy coach Rebecca McKay shows us how to bring those principles to life through purposeful practices that invite children to create an identity through print.",
        "price": 18,
        "quantity": 30378,
        "evidence": false,
        "discount": 50,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3250/9780325062563.jpg"
        ],
        "categories": [
            "Educational Strategies & Policy",
            "Educational Strategies & Policy",
            "Teaching Staff",
            "Teaching Staff",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 9
    },
    {
        "_id": "product",
        "id": "c2046b99-3202-43e5-8820-1c39b23b81d7",
        "name": "The Ultimate Guide to Differentiation : Achieving Excellence for All",
        "searchName": "the ultimate guide to differentiation : achieving excellence for all",
        "description": "This book is the ultimate guide to differentiation in early years, schools and further education settings by Sue Cowley, bestselling author of Getting the Buggers to Behave. It offers over 90 practical and time-saving strategies for effective differentiation in every classroom.",
        "price": 9,
        "quantity": 97819,
        "evidence": false,
        "discount": 87,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4729/9781472948960.jpg"
        ],
        "categories": [
            "Examinations & Assessment",
            "Examinations & Assessment",
            "Pre-school & Kindergarten",
            "Pre-school & Kindergarten",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Secondary Schools",
            "Secondary Schools",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 1.17
    },
    {
        "_id": "product",
        "id": "f467e2e2-d7be-42fe-b1ce-941d130c3c79",
        "name": "Dreaming: A Very Short Introduction",
        "searchName": "dreaming: a very short introduction",
        "description": "What is dreaming, and what causes it? Why are dreams so strange and why are they so hard to remember? Replacing dream mystique with modern dream science, J. Allan Hobson provides a new and increasingly complete picture of how dreaming is created by the brain. Focusing on dreaming to explain the mechanisms of sleep, this book explores how the new science of dreaming is affecting theories in psychoanalysis, and how it is helping our understanding of the causes of",
        "price": 7,
        "quantity": 25060,
        "evidence": false,
        "discount": 36,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/1928/9780192802156.jpg"
        ],
        "categories": [
            "Physiological & Neuro-psychology, Biopsychology",
            "Sleep & Dreams",
            "Health Psychology",
            "Neurology & Clinical Neurophysiology",
            "Popular Science",
            "Dreams & Their Interpretation"
        ],
        "discountedPrice": 4.48
    },
    {
        "_id": "product",
        "id": "335395c2-03ff-4097-9a42-1e337d9bb08f",
        "name": "The Handbook for the New Art and Science of Teaching : (your Guide to the Marzano Framework for Competency-Based Education and Teaching Methods)",
        "searchName": "the handbook for the new art and science of teaching : (your guide to the marzano framework for competency-based education and teaching methods)",
        "description": "Part of The New Art and Science of Teaching series",
        "price": 6,
        "quantity": 79620,
        "evidence": false,
        "discount": 30,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9476/9781947604315.jpg"
        ],
        "categories": [
            "Secondary Schools",
            "Secondary Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 4.2
    },
    {
        "_id": "product",
        "id": "db4c1be9-068a-48da-8ec0-03506f364116",
        "name": "Teaching Young Language Learners",
        "searchName": "teaching young language learners",
        "description": "Each title in the series is intended to serve both as a basis for training courses and seminars, and as a reference text.",
        "price": 15,
        "quantity": 14827,
        "evidence": false,
        "discount": 64,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1944/9780194403184.jpg"
        ],
        "categories": [
            "ELT: Teaching Theory & Methods",
            "ELT: Learning Material & Coursework",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 5.4
    },
    {
        "_id": "product",
        "id": "d8d8843c-09fe-4fc8-a3e8-2e180e6557c5",
        "name": "The Little Book of Cooking from Stories : Little Books with Big Ideas",
        "searchName": "the little book of cooking from stories : little books with big ideas",
        "description": "Traditional and popular stories and simple recipes to go with them. Extend your literacy sessions with simple cooking activities to make and share as you listen again to the story. Linked with the goal for communication, language and literacy.",
        "price": 15,
        "quantity": 57918,
        "evidence": false,
        "discount": 77,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9041/9781904187042.jpg"
        ],
        "categories": [
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "Food Technology"
        ],
        "discountedPrice": 3.45
    },
    {
        "_id": "product",
        "id": "ee845fef-1fae-409a-8f46-f9e04d1feef0",
        "name": "The World Is Blue : How Our Fate and the Ocean's are One",
        "searchName": "the world is blue : how our fate and the ocean's are one",
        "description": "Through compelling personal stories Sylvia Earle puts the current and future peril of the ocean and the life it supports in perspective for a wide public audience.",
        "price": 1,
        "quantity": 2214,
        "evidence": false,
        "discount": 4,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4262/9781426206399.jpg"
        ],
        "categories": [
            "Popular Science",
            "Oceanography (seas)",
            "Environmental Science, Engineering & Technology"
        ],
        "discountedPrice": 0.96
    },
    {
        "_id": "product",
        "id": "658bd748-1a08-4f32-b38f-6bc3d0067e84",
        "name": "TEACHING COLLOCATION",
        "searchName": "teaching collocation",
        "description": "TEACHING COLLOCATION provides further follow-up to THE LEXICAL APPROACH.  It contains papers by a number of teachers and theoreticians interested in the practical classroom implications of incorporating collocation into everyday classroom teaching.",
        "price": 12,
        "quantity": 14331,
        "evidence": false,
        "discount": 91,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8993/9781899396115.jpg"
        ],
        "categories": [
            "Semantics",
            "ELT: Teaching Theory & Methods",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 1.08
    },
    {
        "_id": "product",
        "id": "f41b0d68-9a37-4323-8523-2a08bcc74bb6",
        "name": "Design and Deliver : Planning and Teaching Using Universal Design for Learning",
        "searchName": "design and deliver : planning and teaching using universal design for learning",
        "description": "Universal Design for Learning is the best way to teach all students effectively-but how can a busy teacher get started with UDL right now? Answers are in this vibrant, research-based guidebook, created by seasoned teacher and former UDL Coordinator Loui Lord Nelson. K-12 educators will learn how to use the three key principles of UDL-Engagement, Representation, and Action & Expression-to present information in multiple ways and meet the needs of diverse learners. Written in first person, like a face-to-face talk with a passionate educator, the book gives teachers a reader-friendly UDL primer and a practical framework for implementation, with detailed guidelines on lesson planning and checkpoints that help them stay on track.",
        "price": 2,
        "quantity": 51798,
        "evidence": false,
        "discount": 6,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5985/9781598573503.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Inclusive Education / Mainstreaming",
            "Inclusive Education / Mainstreaming",
            "Curriculum Planning & Development",
            "Curriculum Planning & Development",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 1.88
    },
    {
        "_id": "product",
        "id": "649bdd21-82a6-4178-9552-7de6d9bade6b",
        "name": "The 12 Touchstones of Good Teaching : A Checklist for Staying Focused Every Day",
        "searchName": "the 12 touchstones of good teaching : a checklist for staying focused every day",
        "description": "Checklists help us work better. They help us manage complex tasks more effectively and ensure we apply what we know correctly and consistently. They've become indispensable for airline pilots and doctors, but can this low-tech approach to planning and problem solving demand a place in the teacher's toolkit? Teaching is complicated, with challenging decisions and important consequences, but it's in the most complex situations that a straightforward checklist can be the most useful.",
        "price": 15,
        "quantity": 58323,
        "evidence": false,
        "discount": 82,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4166/9781416616016.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Adult Education, Continuous Learning",
            "Adult Education, Continuous Learning",
            "Industrial Or Vocational Training",
            "Industrial Or Vocational Training",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Personal Development"
        ],
        "discountedPrice": 2.7
    },
    {
        "_id": "product",
        "id": "d0d37377-00b5-4f41-baf9-a946bcb4f19f",
        "name": "A Man on the Moon : The Voyages of the Apollo Astronauts",
        "searchName": "a man on the moon : the voyages of the apollo astronauts",
        "description": "The authoritative masterpiece (L. A. Times) on the Apollo space program and NASA's journey to the moon This acclaimed portrait of heroism and ingenuity captures a watershed moment in human history. The astronauts themselves have called it the definitive account of their missions. On the night of July 20, 1969, our world changed forever when Neil Armstrong and Buzz Aldrin walked on the moon. Based on in-depth interviews with twenty-three of the twenty-four moon voyagers, as well as those who struggled to get the program moving, A Man on the Moon conveys every aspect of the Apollo missions with breathtaking immediacy and stunning detail. A Man on the Moon is also the basis for the acclaimed miniseries produced by Tom Hanks, From the Earth to the Moon, now airing and streaming again on HBO in celebration of the 50th anniversary of Apollo 11.",
        "price": 2,
        "quantity": 85942,
        "evidence": false,
        "discount": 42,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1431/9780143112358.jpg"
        ],
        "categories": [
            "History Of The Americas",
            "History Of Science",
            "Astrophysics",
            "History Of Engineering & Technology",
            "Aerospace & Aviation Technology",
            "Space Science"
        ],
        "discountedPrice": 1.16
    },
    {
        "_id": "product",
        "id": "0f593a74-a7cf-46f0-b5bb-3094f26bba7b",
        "name": "It Won't Be Easy : An Exceedingly Honest (and Slightly Unprofessional) Love Letter to Teaching",
        "searchName": "it won't be easy : an exceedingly honest (and slightly unprofessional) love letter to teaching",
        "description": "Tom Rademacher wishes someone had handed him this sort of book along with his teaching degree: a clear-eyed, frank, boots-on-the ground account of what he was getting into. But first he had to write it. And as 2014's Minnesota Teacher of the Year, Rademacher knows what he's talking about. Less a how-to manual than a tribute to an impossible and impossibly rewarding profession, It Won't Be Easy captures the experience of teaching in all its messy glory.The book follows a year of teaching, with each chapter tackling a different aspect of the job. Pulling no punches (and resisting no punch lines), he writes about establishing yourself in a new building; teaching meaningful classes, keeping students a priority; investigating how race, gender, and identity affect your work; and why it's a good idea to keep an extra pair of pants at school. Along the way he answers the inevitable and the unanticipated questions, from what to do with Google to how to tell if you're really a terrible teacher, to why \"Keep your head down\"might well be the worst advice for a new teacher.Though directed at prospective and newer teachers, It Won't Be Easy is mercifully short on jargon and long on practical wisdom, accessible to anyone-teacher, student, parent, pundit-who is interested in a behind-the-curtain look at teaching and willing to understand that, while there are no simple answers, there is power in learning to ask the right questions.",
        "price": 6,
        "quantity": 83297,
        "evidence": false,
        "discount": 13,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5179/9781517901127.jpg"
        ],
        "categories": [
            "Teaching Resources & Education",
            "Teaching Resources & Education",
            "Teaching Staff",
            "Teaching Staff",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 5.22
    },
    {
        "_id": "product",
        "id": "89640b07-ed1c-4845-ab70-387bfd571d2f",
        "name": "On Your Mark : Challenging the Conventions of Grading and Reporting",
        "searchName": "on your mark : challenging the conventions of grading and reporting",
        "description": "Create and sustain a learning environment where students thrive and stakeholders are accurately informed of student progress. Clarify the purpose of grades, craft a vision statement aligned with this purpose, and discover research-based strategies to implement effective grading and reporting practices. Identify policies and practices that render grading inaccurate, and understand the role grades play in students' future success and opportunities.",
        "price": 19,
        "quantity": 1006,
        "evidence": false,
        "discount": 39,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9355/9781935542773.jpg"
        ],
        "categories": [
            "Teaching Resources & Education",
            "Teaching Resources & Education",
            "Organization & Management Of Education",
            "Organization & Management Of Education",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 11.59
    },
    {
        "_id": "product",
        "id": "5adf0a05-1f2e-4137-b9e6-90593eecae38",
        "name": "Schools for All Kinds of Minds : Boosting Student Success by Embracing Learning Variation",
        "searchName": "schools for all kinds of minds : boosting student success by embracing learning variation",
        "description": "This book shows how schools can--and must--develop expertise in \"learning variation\" (understanding how different kinds of minds learn) and apply this knowledge to classroom instruction in order to address the chronic learning challenges and achievement gap faced by millions of students. Barringer shows how using what we know about learning variation with a focus on discovering learning strengths, not just deficits, can help schools create plans for success for those students who often find it elusive. The book specifically addresses how school leaders can incorporate this knowledge into instructional practice and school-level policy through various professional development strategies.  Schools for All Kinds of Minds: * Provides a readable synthesis of the latest research from neuroscience, cognitive science, and child and adolescent development as it relates to understanding learning and its many variations. * Links this information to strategies for understanding struggling learners and adapting school practices to accommodate a wider array of learning differences in a classroom.",
        "price": 6,
        "quantity": 87266,
        "evidence": false,
        "discount": 10,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4705/9780470505151.jpg"
        ],
        "categories": [
            "Educational Psychology",
            "Educational Psychology",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Educational Equipment & Technology, Computer-aided Learning (CAL)",
            "Educational Equipment & Technology, Computer-aided Learning (CAL)"
        ],
        "discountedPrice": 5.4
    },
    {
        "_id": "product",
        "id": "196c77ac-94c0-4d6b-9601-752fdf95654c",
        "name": "Activate 2 Student Book",
        "searchName": "activate 2 student book",
        "description": "Activate is a new Key Stage 3 Science course for the 2014 curriculum, designed to support every student on their journey through Key Stage 3 to Key Stage 4 success. This student book will spark students' curiosity in science, whilst gradually building the maths, literacy and working scientifically skills vital for success in the new GCSEs.",
        "price": 11,
        "quantity": 3302,
        "evidence": false,
        "discount": 84,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/1983/9780198392576.jpg"
        ],
        "categories": [
            "Science: General Issues",
            "Sciences"
        ],
        "discountedPrice": 1.76
    },
    {
        "_id": "product",
        "id": "28c97700-f5d0-4c8c-b803-62e55cff99d7",
        "name": "Your UDL Lesson Planner : The Step-by-Step Guide for Teaching All Learners",
        "searchName": "your udl lesson planner : the step-by-step guide for teaching all learners",
        "description": "Many teacher resources explore the fundamentals of Universal Design for Learning (UDL). This one takes UDL to the next level for educators who understand the basics-and can't wait to start using UDL in their lesson plans and classrooms.",
        "price": 9,
        "quantity": 22148,
        "evidence": false,
        "discount": 17,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6812/9781681250021.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Teaching Staff",
            "Teaching Staff",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 7.47
    },
    {
        "_id": "product",
        "id": "34a5b886-6dff-40b3-be97-8a3b914280e0",
        "name": "Using Psychology in the Classroom",
        "searchName": "using psychology in the classroom",
        "description": "Psychology can be applied to understanding a range of current issues and topics in teaching and educational practice. Starting with the question, 'what is psychology?', and a topical overview of child and adolescent development, Stephen James Minton moves on to discuss seven areas of contemporary concern in education, showing how psychological approaches can help teachers in key areas of practice.",
        "price": 17,
        "quantity": 33975,
        "evidence": false,
        "discount": 14,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4462/9781446201664.jpg"
        ],
        "categories": [
            "Educational Psychology",
            "Educational Psychology",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 14.62
    },
    {
        "_id": "product",
        "id": "36d649ec-6d85-481b-b61e-d895bf8429f3",
        "name": "Cultivating Genius : An Equity Framework for Culturally and Historically Responsive Literacy",
        "searchName": "cultivating genius : an equity framework for culturally and historically responsive literacy",
        "description": "In Cultivating Genius, Dr. Gholdy E. Muhammad presents a four-layered equity framework&;one that is grounded in history and restores excellence in literacy education.&#160;This framework, which she names, Historically Responsive Literacy, was derived from the study of literacy development within 19th-century&#160;Black literacy societies. The framework is essential and universal for all students, especially youth of color, who traditionally have been marginalized in learning standards, school policies, and classroom practices. The equity framework will help educators teach and lead toward the following learning goals or pursuits:",
        "price": 15,
        "quantity": 65229,
        "evidence": false,
        "discount": 75,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/3385/9781338594898.jpg"
        ],
        "categories": [
            "Literacy",
            "Multicultural Education",
            "Multicultural Education",
            "Teaching Staff",
            "Teaching Staff",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "Children's Foreign Language Books"
        ],
        "discountedPrice": 3.75
    },
    {
        "_id": "product",
        "id": "1b30e47d-536b-4bb9-b0d5-6d103d7777f1",
        "name": "Adventures with a Microscope",
        "searchName": "adventures with a microscope",
        "description": "With a simple microscope and this book, you can embark on 59 wonderful adventures in the natural world -- make discoveries about the structures of numerous microscopic animals; find out what everyday objects and foods really look like at the cellular level; gain an understanding of how to prepare specimens and slides; and learn about many scientific phenomena such as how a fly can walk upside down on the ceiling. It's all here in simple-to-understand language and 142 clear line drawings.",
        "price": 19,
        "quantity": 85555,
        "evidence": false,
        "discount": 36,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4862/9780486234717.jpg"
        ],
        "categories": [
            "Scientific Equipment, Experiments & Techniques",
            "Biology, Life Sciences",
            "Natural History Books"
        ],
        "discountedPrice": 12.16
    },
    {
        "_id": "product",
        "id": "d28549e8-c9f2-47b5-b5d5-07dcdb63cbc0",
        "name": "Teaching Digital Natives : Partnering for Real Learning",
        "searchName": "teaching digital natives : partnering for real learning",
        "description": "Students today are growing up in a digital world. These \"digital natives\" learn in new and different ways, so educators need new approaches to make learning both real and relevant for today's students.",
        "price": 10,
        "quantity": 73267,
        "evidence": false,
        "discount": 84,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4129/9781412975414.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Educational Equipment & Technology, Computer-aided Learning (CAL)",
            "Educational Equipment & Technology, Computer-aided Learning (CAL)",
            "Mathematics & Numeracy"
        ],
        "discountedPrice": 1.6
    },
    {
        "_id": "product",
        "id": "099c6f73-8e1d-4e1c-8fe5-f38377a9ab2b",
        "name": "Perfect Phrases for Classroom Teachers",
        "searchName": "perfect phrases for classroom teachers",
        "description": "Find the right words for report cards, parent-teacher conferences, and more",
        "price": 12,
        "quantity": 92830,
        "evidence": false,
        "discount": 82,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/0716/9780071630153.jpg"
        ],
        "categories": [
            "Examinations & Assessment",
            "Examinations & Assessment",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 2.16
    },
    {
        "_id": "product",
        "id": "37c6e667-4439-4e29-9c9e-e1bd37284091",
        "name": "80 Morning Meeting Ideas for Grades 3-6",
        "searchName": "80 morning meeting ideas for grades 3-6",
        "description": "Eighty easy-to-do, classroom-tested ideas to help you plan engaging, purposeful Morning Meetings for third, fourth, fifth, and sixth grade students. The book includes: 20 friendly greetings, 20 empowering sharings, 20 engaged activities, and 20 inspiring messages.",
        "price": 18,
        "quantity": 73148,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8929/9781892989482.jpg"
        ],
        "categories": [
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 14.22
    },
    {
        "_id": "product",
        "id": "4051ac35-c2a4-4f67-aeb8-e4103e6fa6e7",
        "name": "What Doesn't Kill Us: how freezing water, extreme altitude, and environmental conditioning will renew our lost evolutionary strength",
        "searchName": "what doesn't kill us: how freezing water, extreme altitude, and environmental conditioning will renew our lost evolutionary strength",
        "description": "What are our bodies really capable of?",
        "price": 19,
        "quantity": 12644,
        "evidence": false,
        "discount": 68,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9253/9781925321999.jpg"
        ],
        "categories": [
            "True Stories Of Heroism, Endurance & Survival",
            "Popular Science",
            "Extreme Sports"
        ],
        "discountedPrice": 6.08
    },
    {
        "_id": "product",
        "id": "c1f308ed-04ee-46a5-8ac0-ddd62cb31e2e",
        "name": "The Teachers Toolkit Volume 1 : Promoting Variety, Engagement, and Motivation in the Classroom US EDITION",
        "searchName": "the teachers toolkit volume 1 : promoting variety, engagement, and motivation in the classroom us edition",
        "description": "This best-selling teacher's resource now reformatted and edited is packed with practical classroom strategies that will enable teachers to add spice to their teaching while meeting the different learning styles of their students.Drawing on insights from neuroscience, psychology, and sociology, The Teacher's Toolkit provides forty varied learning activities as well as practical ideas for managing group work, tackling disruptive behavior, and promoting personal responsibility.The audit tools in the final section enable the teacher to check everything including lesson plans; teacher's impact on students' self-esteem; and delivery of independent learning skills. The Teacher's Toolkit will help develop students' thinking skills, fine-tune their study skills, promote citizenship, and help students acquire the attitude and skills for true independence. For Grades K-12There should be a copy of The Teacher's Toolkit in every curriculum area of the school. It puts learning where it should be-at the top of the school agenda.- Clive Carroll, Education Development Unit, St. Martin's College",
        "price": 3,
        "quantity": 50976,
        "evidence": false,
        "discount": 36,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9044/9781904424581.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Curriculum Planning & Development",
            "Curriculum Planning & Development",
            "Secondary Schools",
            "Secondary Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 1.92
    },
    {
        "_id": "product",
        "id": "106a15fe-52b6-49ec-b970-ac7eff3f77b6",
        "name": "Perfect Assessment for Learning",
        "searchName": "perfect assessment for learning",
        "description": "It has been a while since 'Tick. V.G.' was an acceptable way of marking a child's work but the idea of how to use assessment to improve learning is still a battle for many teachers. This is a simple 'how-to' guide for improving achievement by implementing sustainable Assessment for Learning (or AfL) in your school. Topics covered include how to shift staff culture to embed great practice, helping children own their own learning, effective use of learning objectives, working well with parents and using AfL to demonstrate pupils' progress. Too often, valuable teacher time is spent on the kind of marking that makes little difference to progress. This little book takes the busy teacher through a range of strategies to ensure that assessment, progress and learning are inextricably linked.",
        "price": 1,
        "quantity": 79250,
        "evidence": false,
        "discount": 4,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7813/9781781350027.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Organization & Management Of Education",
            "Organization & Management Of Education",
            "Examinations & Assessment",
            "Examinations & Assessment",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 0.96
    },
    {
        "_id": "product",
        "id": "37bf7782-ad94-42d3-bcb6-cc4e19b29af8",
        "name": "Diagraming Sentences",
        "searchName": "diagraming sentences",
        "description": "Diagraming Sentences will help students of all ages learn how the parts of speech fit together to make clear and complete sentences. This 48-page book shows visual learners how to diagram sentences to help them understand why some sentences may not sound or look right. The book also includes fun practice activities, review activities, a glossary, and answer keys.",
        "price": 14,
        "quantity": 40474,
        "evidence": false,
        "discount": 46,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5803/9781580372824.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "Schools & Museums",
            "English Language"
        ],
        "discountedPrice": 7.56
    },
    {
        "_id": "product",
        "id": "c198a88b-f9cd-4876-bb3d-f4a2418e0774",
        "name": "Short-cut Mathematics",
        "searchName": "short-cut mathematics",
        "description": "Can you multiply 362 x .5 quickly in your head? Could you readily calculate the square of 41? How much is 635 divided by 21/2? Can 727,648 be evenly divided by 8?",
        "price": 1,
        "quantity": 36751,
        "evidence": false,
        "discount": 37,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4862/9780486246116.jpg"
        ],
        "categories": [
            "Mathematics",
            "Mathematical Foundations",
            "Science: General Issues"
        ],
        "discountedPrice": 0.63
    },
    {
        "_id": "product",
        "id": "c8b58ec0-bcba-45be-9696-2226a8dba77a",
        "name": "100 Great EFL Games : Exciting Language Games for Young Learners",
        "searchName": "100 great efl games : exciting language games for young learners",
        "description": "Make the students ask and answer about body parts when they play Alien Teacher. Get your students moving around with Five Friends or learn and practise occupations with The 100 Points Job Game. Use directions to play the highly entertaining Cat and Mouse, prepositions in The Magician Game or consolidate reading through a variety of games such as Five in a Row and Edge to Edge. Your male students will particularly enjoy showing their reading ability when they play Mosquito Game. `Where Are You From?' will give your students chances to enthusiastically ask and answer about countries. Let them burn off some energy with a variety of challenges through Relay Games. Practise numbers large and small, as well as ordinal numbers, by playing 3, 6, 9. Give the students chance to show some creativity with Do It Yourself! This extensive collection of games also includes: Four Knights, Let's Play Snap, The Apple Game, The Shopping Game, Liar, Liar, Liar!, The Argument Game, Dictionary Race, Down the Line, The Kitchen Game, Jigsaw Game, Find the Animals and One Dog, Two Dogs, Three Dogs.",
        "price": 11,
        "quantity": 68668,
        "evidence": false,
        "discount": 0,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9567/9780956796806.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 11
    },
    {
        "_id": "product",
        "id": "022e1971-3b06-4f7d-845c-1386db2ec4c2",
        "name": "Ready-to-Use Social Skills Lessons & Activities for Grades 4 - 6",
        "searchName": "ready-to-use social skills lessons & activities for grades 4 - 6",
        "description": "This unique Library gives teachers and specialists a stimulating, systematic way to develop positive social behaviors in students of all abilities, grades 4-12. Included are over 125 tested lessons and reproducible worksheets in two separately printed, self-contained volumes, each tailored to the developmental needs of students at a particular grade level, 4-6 or 7-12. For easy use, the lessons in each volume follow a uniform format, including titles, behavioral objective, and simple 8-step lesson plan. The lesson activities and worksheets are based on real-life situations and help build students' self-esteem, self-control, and respect for the rights of others.",
        "price": 12,
        "quantity": 65091,
        "evidence": false,
        "discount": 63,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/mid/9780/8762/9780876284742.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Students & Student Organisations",
            "Students & Student Organisations",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "General Study Books"
        ],
        "discountedPrice": 4.44
    },
    {
        "_id": "product",
        "id": "54d82ab6-a769-482c-84e3-2e7e6ec9e9f8",
        "name": "What a Writer Needs, Second Edition",
        "searchName": "what a writer needs, second edition",
        "description": "This is no recipe book: I have tried not to be formulaic. Rather, I want to suggest the richness of options, the myriad possibilities open to the writer at any given moment. Young writers need to know what can be done with language.",
        "price": 10,
        "quantity": 26904,
        "evidence": false,
        "discount": 8,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3250/9780325046662.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teacher Training",
            "Teacher Training",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 9.2
    },
    {
        "_id": "product",
        "id": "371caab9-b876-48de-9d7e-1a95129de775",
        "name": "Rosalind Franklin : The Dark Lady of DNA",
        "searchName": "rosalind franklin : the dark lady of dna",
        "description": "In 1962, Maurice Wilkins, Francis Crick, and James Watson received the Nobel Prize, but it was Rosalind Franklin's data and photographs of DNA that led to their discovery.",
        "price": 3,
        "quantity": 23146,
        "evidence": false,
        "discount": 79,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/0609/9780060985080.jpg"
        ],
        "categories": [
            "Biography: General",
            "Biography: Science, Technology & Engineering",
            "Gender Studies: Women",
            "History Of Science",
            "Genetics (non-medical)",
            "DNA & Genome"
        ],
        "discountedPrice": 0.63
    },
    {
        "_id": "product",
        "id": "92f96e69-f98d-480f-b068-ecf6ce699e83",
        "name": "Visible Maths : Using representations and structure to enhance mathematics teaching in schools",
        "searchName": "visible maths : using representations and structure to enhance mathematics teaching in schools",
        "description": "Viewing the maths lesson as an opportunity for pupils to develop a deep understanding of mathematical concepts and relationships, rather than simply to follow fixed processes that lead to 'the answer', is increasingly recognised as the pinnacle of best practice in maths education.",
        "price": 20,
        "quantity": 18851,
        "evidence": false,
        "discount": 80,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7858/9781785833502.jpg"
        ],
        "categories": [
            "Teaching Resources & Education",
            "Teaching Resources & Education",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "Mathematics & Numeracy"
        ],
        "discountedPrice": 4
    },
    {
        "_id": "product",
        "id": "95bec2da-2752-41a8-ae2c-e395fa4d7d7f",
        "name": "Being Me (and Loving It) : Stories and Activities to Help Build Self-Esteem, Confidence, Positive Body Image and Resilience in Children",
        "searchName": "being me (and loving it) : stories and activities to help build self-esteem, confidence, positive body image and resilience in children",
        "description": "With 29 real life and relatable stories at its heart, this practical resource is designed to help build self-esteem and body confidence in children aged 5-11. Each story is the focus of a ready-to-use lesson plan, covering common issues that affect children such as a lack of body confidence, feeling pressured by peers and worries about puberty. The stories are preceded by guidance on how to introduce the topic and the learning outcomes, and they are followed by a range of activities to reinforce the messages being taught. The stories can either be read aloud to a class or group or photocopied and shared for individual reading.",
        "price": 12,
        "quantity": 26078,
        "evidence": false,
        "discount": 25,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8490/9781849057134.jpg"
        ],
        "categories": [
            "Education: Care & Counselling Of Students",
            "Education: Care & Counselling Of Students",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teachers' Classroom Resources & Material",
            "Teachers' Classroom Resources & Material",
            "Assertiveness, Motivation & Self-esteem",
            "Self-Esteem"
        ],
        "discountedPrice": 9
    },
    {
        "_id": "product",
        "id": "75ba6c3b-a6e0-43dc-8eaa-3569e6124cf3",
        "name": "The Instructional Playbook : The Missing Link for Translating Research into Practice",
        "searchName": "the instructional playbook : the missing link for translating research into practice",
        "description": "In schools, every day is \"\"game day.\"\" Every day, teachers need the best resources and forms of support because students deserve the best we as educators can offer. An instructional playbook aims to serve as that kind of support: a tool that coaches can use to help teachers match specific learning goals with the right research-based instructional strategies.",
        "price": 3,
        "quantity": 46270,
        "evidence": false,
        "discount": 35,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4166/9781416629924.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Teacher Training",
            "Teacher Training",
            "Adult Education, Continuous Learning",
            "Adult Education, Continuous Learning",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 1.95
    },
    {
        "_id": "product",
        "id": "a3fe1101-744b-4d21-ab82-800a5864437d",
        "name": "We Need to Talk About Kelvin : What everyday things tell us about the universe",
        "searchName": "we need to talk about kelvin : what everyday things tell us about the universe",
        "description": "Look around you. The reflection of your face in a window tells you that the universe is orchestrated by chance. The iron in a spot of blood on your finger tells you that somewhere out in space there is furnace at a temperature of 4.5 billion degrees. Your TV tells you that the universe had a beginning. In fact, your very existence tells you that this may not be the only universe but merely one among an infinity of others, stacked like the pages of a never-ending book.",
        "price": 10,
        "quantity": 80107,
        "evidence": false,
        "discount": 26,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/5712/9780571244034.jpg"
        ],
        "categories": [
            "Popular Science",
            "Biology, Life Sciences"
        ],
        "discountedPrice": 7.4
    },
    {
        "_id": "product",
        "id": "6812cdb3-7c4d-4a4b-9ed3-4873cd725410",
        "name": "Don't Forget to Write for the Secondary Grades : 50 Enthralling and Effective Writing Lessons (Ages 11 and Up)",
        "searchName": "don't forget to write for the secondary grades : 50 enthralling and effective writing lessons (ages 11 and up)",
        "description": "Fantastic strategies for getting high school students excited about writing This book offers 50 creative writing lesson plans from the imaginative and highly acclaimed 826 National writing labs. Created as a resource to reach all students (even those most resistant to creative writing), the off-beat and attention-grabbing lessons include such gems as \"Literary Facebooks,\" where students create a mock Facebook profile based on their favorite literary character, as well as highly practical lessons like the \"College Application Essay Boot Camp.\" These writing lessons are written by experts and favorite novelists, actors, and other entertainers pitched in too. * Road-tested lessons from a stellar national writing lab * Inventive and unique lessons that will appeal to even the most difficult-to-reach students * Includes a chart linking lessons to the Common Core State Standards 826 National is an organization committed to supporting teachers, publishing student work, and offering services for English language learners.",
        "price": 8,
        "quantity": 22994,
        "evidence": false,
        "discount": 1,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/1180/9781118024324.jpg"
        ],
        "categories": [
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Secondary Schools",
            "Secondary Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "English Language: Reading & Writing Skills"
        ],
        "discountedPrice": 7.92
    },
    {
        "_id": "product",
        "id": "4c11f1de-c2ec-4a24-842a-fc16198e9318",
        "name": "Learning Together with Young Children : A Curriculum Framework for Reflective Teachers",
        "searchName": "learning together with young children : a curriculum framework for reflective teachers",
        "description": "Offering an alternative approach to standardization and data-driven mandates, this book puts children at the center of planning. Using The Thinking Lens (R) protocol teachers can translate educational theories into concrete ideas for working with children and families. Learn to create a classroom culture, develop routines, and use learning stories to enhance experiences for the children in your care.",
        "price": 5,
        "quantity": 52649,
        "evidence": false,
        "discount": 26,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6055/9781605545226.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Pre-school & Kindergarten",
            "Pre-school & Kindergarten",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 3.7
    },
    {
        "_id": "product",
        "id": "521b909b-f903-43a6-aba4-7e78b6a8b6be",
        "name": "Real Food, Really Fast : Delicious Plant-Based Recipes Ready in 10 Minutes or Less",
        "searchName": "real food, really fast : delicious plant-based recipes ready in 10 minutes or less",
        "description": "The promise of a hot, satisfying meal in ten minutes or less is no longer the exclusive calling card of cheap pizza delivery. Everything from dinners on the run to crave-worthy snacks for a crowd can be yours in less time than it takes to hunt down those crusty take-out menus.",
        "price": 8,
        "quantity": 61746,
        "evidence": false,
        "discount": 79,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5107/9781510727595.jpg"
        ],
        "categories": [
            "Health & Wholefood Cookery",
            "Vegetarian Cookery",
            "Cookery Dishes & Courses"
        ],
        "discountedPrice": 1.68
    },
    {
        "_id": "product",
        "id": "77df98a2-82de-44c7-9b25-2c37804d32c1",
        "name": "The Age of Surveillance Capitalism : The Fight for a Human Future at the New Frontier of Power",
        "searchName": "the age of surveillance capitalism : the fight for a human future at the new frontier of power",
        "description": "The challenges to humanity posed by the digital future, the first detailed examination of the unprecedented form of power called \"surveillance capitalism,\" and the quest by powerful corporations to predict and control our behavior.  In this masterwork of original thinking and research, Shoshana Zuboff provides startling insights into the phenomenon that she has named surveillance capitalism. The stakes could not be higher: a global architecture of behavior modification threatens human nature in the twenty-first century just as industrial capitalism disfigured the natural world in the twentieth.  Zuboff vividly brings to life the consequences as surveillance capitalism advances from Silicon Valley into every economic sector. Vast wealth and power are accumulated in ominous new \"behavioral futures markets,\" where predictions about our behavior are bought and sold, and the production of goods and services is subordinated to a new \"means of behavioral modification.\"  The threat has shifted from a totalitarian Big Brother state to a ubiquitous digital architecture: a \"Big Other\" operating in the interests of surveillance capital. Here is the crucible of an unprecedented form of power marked by extreme concentrations of knowledge and free from democratic oversight. Zuboff's comprehensive and moving analysis lays bare the threats to twenty-first century society: a controlled \"hive\" of total connection that seduces with promises of total certainty for maximum profit -- at the expense of democracy, freedom, and our human future.  With little resistance from law or society, surveillance capitalism is on the verge of dominating the social order and shaping the digital future -- if we let it.",
        "price": 15,
        "quantity": 13797,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6103/9781610395694.jpg"
        ],
        "categories": [
            "Information Theory",
            "Social Issues & Processes",
            "Economics",
            "Economics",
            "Economic Systems & Structures",
            "Economic Systems & Structures",
            "Market Research",
            "Surveillance Services",
            "Information Technology Industries",
            "Impact Of Science & Technology On Society",
            "Ethical & Social Aspects Of Computing"
        ],
        "discountedPrice": 4.65
    },
    {
        "_id": "product",
        "id": "700751f6-a036-48e5-b429-e8fd33894feb",
        "name": "Teaching with Your Mouth Shut",
        "searchName": "teaching with your mouth shut",
        "description": "Our traditional Great Teacher teaches by telling, inspiring students through eloquent, passionate oration. For Donald Finkel this view is destructively narrow: it takes for granted that teachers teach, fundamentally and centrally, by telling students what they are supposed to know. In Teaching with Your Mouth Shut,  Finkel proposes an alternative vision of teachingone that is deeply democratic in its implications.",
        "price": 7,
        "quantity": 82792,
        "evidence": false,
        "discount": 93,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/8670/9780867094695.jpg"
        ],
        "categories": [
            "Higher & Further Education, Tertiary Education",
            "Higher & Further Education, Tertiary Education",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 0.49
    },
    {
        "_id": "product",
        "id": "41b2e2cc-e5d4-411c-be76-c323fec8c119",
        "name": "Perfect Poems with Strategies for Building Fluency : Grades 1-2",
        "searchName": "perfect poems with strategies for building fluency : grades 1-2",
        "description": "Help students become confident, fluent readers using poetry. Compiled by a reading specialist, this book includes 50 engaging poems specially selected for building different aspects of oral reading fluency: poems to build intonation and phrasing, poems to build phonics patterns and sight words, and poems for repeated, expert readings. Also includes poems that are just right for partner and small group reading. Plus, research-based background on reading fluency and oral reading strategies to help students succeed.",
        "price": 13,
        "quantity": 26548,
        "evidence": false,
        "discount": 60,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4394/9780439438308.jpg"
        ],
        "categories": [
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "Children's Foreign Language Books"
        ],
        "discountedPrice": 5.2
    },
    {
        "_id": "product",
        "id": "76f113dc-62ea-4794-8b94-8378f17b8320",
        "name": "The New Scoop : Recipes for Dairy-Free, Vegan Ice Cream in Unusual Flavors (Plus: Recipes for Dairy-Free, Vegan Ice Cream in Unusual Flavors (Plus Some Old Favorites)",
        "searchName": "the new scoop : recipes for dairy-free, vegan ice cream in unusual flavors (plus: recipes for dairy-free, vegan ice cream in unusual flavors (plus some old favorites)",
        "description": "Be the boss of your ice cream! Learn to make dairy-free, vegan ice cream, sherbet, sorbet and frozen yogurt at home easily, with or without an ice cream machine (although a machine is recommended.) Use easy-to-find ingredients, and nondairy milks and sweeteners. Recipes in this cookbook include standard favorites, such as Chocolate, Vanilla, Strawberry, Mint Chocolate Chip, Mocha Almond Fudge, and Pumpkin Ice Creams. But there are also more unusual flavors, such as Tomato Basil and Black Sesame Ice Creams. There are also complete instructions for making yogurt at home, which you can then use to make frozen yogurts. And one entire chapter is dedicated to making Mochi Ice Cream, with step-by-step directions. Vegans and people with allergies, lactose intolerance, or food sensitivities will find this a useful resource. Anyone looking for healthier ice cream alternatives will find lots to satisfy them. Ice cream lovers with a sense of adventure can attempt some of the more unique ice cream flavors, such as: Taro Ice Cream Strawberry Basil Balsamic Ice Cream Papaya Frozen Yogurt Lychee No-jito Sherbet Chocolate Curry Ice Cream Cucumber Mint Frozen Yogurt Azuki Ice Cream Chocolate Lavender Ice Cream These healthier recipes are soy, coconut, rice, and nut milk based. They contain no cholesterol and are lower in saturated fat than their dairy counterparts. Stop paying ridiculous prices for mediocre non-dairy treats. Make your own delicious, creamy, dreamy concoctions at home with this cookbook. READER REVIEWS: I just made the fresh guava ice cream recipe out of my friend Alina's new vegan ice cream cookbook. I used my Mom's guavas and it came out wonderfully smooth and creamy. The fresh guava is subtle and fragrant. I am actually not missing the heavy cream I would usually be using. The recipes run the gamut from classic favorites (Mint Chocolate Chip) to intriguing, mind-bending combinations (Carrot Apple Coconut Curry). It is more than an ice cream cookbook. It it a passionate treatise on taking ice cream making to the level of a grand adventure. I wonder how many ice cream machines were sacrificed testing these more than 100 recipes. I will definitely be trying more soon. I have my eye on the lilikoi frozen yogurt recipe next since I have so many lilikoi right now. -Dorothy Arriola Colby This recipe book contains 15 chapters and an Index for a total of 208 pages. In the last chapter it contains the topic of TROUBLE SHOOTING. I'd welcome seeing that in any cookbook I buy and use. For the most part, I stay out of the kitchen. So I should probably stay out of the kitchen for sure. But these recipes for ice cream are fascinating, and the many pictures entice the reader into trying something new and different. Who are the readers of this book? Readers who are tired of ordinary ice cream, who have dietary problems that require different ingredients, or who are searching for a new experience in ice cream eating. For those readers I recommend this book. In the first chapters, you'll learn the difference between ice cream, sherbet, sorbet, granita, and frozen yogurt. The author then introduces you to the various kinds of milk you may want to try-coconut, soy, grain milks and the ingredients you may want to mix with the milk. You'll need fats, starches, sweeteners, agave nectar, maple syrup and others. And to insure edible results you'll need the right equipment in your kitchen. This can be as simple or as elaborate as you care to make it. And of course, you'll find dozens of recipes to tempt you. My advice is to read the book through carefully before you begin trying a recipe. Each success will lead to another. This book is a winner. Dorothy Francis www.dorothyfrancis.com KILLER IN CONTROL, 2011 (Five Star) DAIQUIRI DOCK MURDER, 2012 (Five Star) 4 Five Star mysteries on Amazon Kindle",
        "price": 8,
        "quantity": 31130,
        "evidence": false,
        "discount": 21,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9373/9781937371005.jpg"
        ],
        "categories": [
            "Vegetarian Cookery",
            "Desserts"
        ],
        "discountedPrice": 6.32
    },
    {
        "_id": "product",
        "id": "23aeb8bd-8cdb-4842-8870-2458b72c3871",
        "name": "Oliver Sacks: The Last Interview",
        "searchName": "oliver sacks: the last interview",
        "description": "An extraordinary collection of interviews with the beloved doctor and author, whose research and books inspired generations of readers. Oliver Sacks--called the poet laureate of medicine by the New York Times--illuminated the mysteries of the brain for a wide audience in a series of richly acclaimed books, including Awakenings and The Man Who Mistook His Wife for a Hat, and numerous New Yorker articles. In this collection of interviews, Sacks is at his most candid and disarming, rich with insights about his life and work. Any reader of Sacks will find in this book an entirely new way of looking at a brilliant writer.",
        "price": 4,
        "quantity": 23833,
        "evidence": false,
        "discount": 83,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6121/9781612195773.jpg"
        ],
        "categories": [
            "Biography: General",
            "Biography: Literary",
            "Biography: Science, Technology & Engineering",
            "Neurology & Clinical Neurophysiology",
            "Popular Science"
        ],
        "discountedPrice": 0.68
    },
    {
        "_id": "product",
        "id": "7c59de1d-9e46-4d66-9816-7e4cb774eaeb",
        "name": "The Spinning Heart",
        "searchName": "the spinning heart",
        "description": "Scene by Scene guides are teaching resources. They are short books of questions, designed to save teachers time and lead to rewarding classroom experiences. Each guide is broken down by scene or chapter, to match and complement the text it accompanies. This means that the teacher is provided with a clear list of questions, at every stage of teaching the text. These questions can be used in class, or as homework, and so provide underlying structure to lesson planning.",
        "price": 1,
        "quantity": 84908,
        "evidence": false,
        "discount": 14,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9109/9781910949030.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teachers' Classroom Resources & Material",
            "Teachers' Classroom Resources & Material"
        ],
        "discountedPrice": 0.86
    },
    {
        "_id": "product",
        "id": "27ea287d-521f-472f-a931-cedd085d5eff",
        "name": "Stirring the Head, Heart, and Soul : Facilitator's Guide: Redefining Curriculum, Instruction, and Concept-Based Learning",
        "searchName": "stirring the head, heart, and soul : facilitator's guide: redefining curriculum, instruction, and concept-based learning",
        "description": "Demonstrate how teachers can use a \"conceptual lens\" to design instructional units and differentiated lessons that deepen students' thinking skills and inspire a genuine love of learning.",
        "price": 12,
        "quantity": 88383,
        "evidence": false,
        "discount": 52,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4129/9781412966276.jpg"
        ],
        "categories": [
            "Learning",
            "Educational Psychology",
            "Educational Psychology",
            "Curriculum Planning & Development",
            "Curriculum Planning & Development",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 5.76
    },
    {
        "_id": "product",
        "id": "0e55c57a-cae1-4256-bdcc-55516b227ec5",
        "name": "Simple Green Suppers : A Fresh Strategy for One-Dish Vegetarian Meals",
        "searchName": "simple green suppers : a fresh strategy for one-dish vegetarian meals",
        "description": "The ultimate game plan for complete one-dish vegetarian suppers--for anyone aspiring to eat a more plant-based diet.  Discover the pro-veggie, pro-flavor way to prepare fresh, healthy, high-quality plant-based dinners. In Simple Green Suppers, Susie Middleton demonstrates how to prepare seasonal vegetables in satisfying, filling suppers by pairing them with staple ingredients: noodles, grains, beans, greens, toast, tortillas, eggs, and broth. How you cook your veggies and how you combine them with other satisfying whole foods is the secret to delicious results. With 125 recipes for flavorful and veggie-forward dishes, tips on keeping a flexible and well-stocked pantry, and make-ahead and streamlining strategies, Simple Green Suppers is an essential resource that will make cooking delicious, easy vegetarian meals possible every night.",
        "price": 2,
        "quantity": 84195,
        "evidence": false,
        "discount": 10,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6118/9781611803365.jpg"
        ],
        "categories": [
            "Quick & Easy Cooking",
            "Vegetarian Cookery",
            "Cookery By Ingredient"
        ],
        "discountedPrice": 1.8
    },
    {
        "_id": "product",
        "id": "63bfb3fd-20a6-41f2-8c5d-60511f4cd6c6",
        "name": "A Slow Death : 83 Days of Radiation Sickness",
        "searchName": "a slow death : 83 days of radiation sickness",
        "description": "Japan's worst nuclear radiation accident took place at a uranium reprocessing facility in Tokaimura, northeast of Tokyo, on 30 September 1999. The direct cause of the accident was cited as the depositing of a uranyl nitrate solution--containing about 16.6 kg of uranium, which exceeded the critical mass--into a precipitation tank. Three workers were exposed to extreme doses of radiation. Hiroshi Ouchi, one of these workers, was transferred to the University of Tokyo Hospital Emergency Room, three days after the accident. Dr. Maekawa and his staff initially thought that Ouchi looked relatively well for a person exposed to such radiation levels. He could talk, and only his right hand was a little swollen with redness. However, his condition gradually weakened as the radioactivity broke down the chromosomes in his cells. The doctors were at a loss as to what to do. There were very few precedents and proven medical treatments for the victims of radiation poisoning. Less than 20 nuclear accidents had occurred in the world to that point, and most of those happened 30 years ago. This book documents the following 83 days of treatment until his passing, with detailed descriptions and explanations of the radiation poisoning.",
        "price": 19,
        "quantity": 62406,
        "evidence": false,
        "discount": 90,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9429/9781942993544.jpg"
        ],
        "categories": [
            "Asian History",
            "Social Impact Of Disasters",
            "Science: General Issues",
            "Nuclear Structure Physics",
            "Safety In The Home"
        ],
        "discountedPrice": 1.9
    },
    {
        "_id": "product",
        "id": "9e3f1fbc-5ff8-4f12-92d2-bab5dbeade6f",
        "name": "The Kindness Curriculum : Stop Bullying Before It Starts",
        "searchName": "the kindness curriculum : stop bullying before it starts",
        "description": "Bullying is a widespread and concerning issue that affects children of all ages. Focusing on character education in the early years, this resource aims to prevent bullying before it starts. Educators can use this comprehensive framework and developmentally appropriate activities to teach young children compassion, conflict resolution, respect, and other positive, pro-social values as they cultivate a peaceful and supportive learning environment for all children.",
        "price": 4,
        "quantity": 64722,
        "evidence": false,
        "discount": 50,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/6055/9781605541242.jpg"
        ],
        "categories": [
            "Philosophy & Theory Of Education",
            "Philosophy & Theory Of Education",
            "Educational Strategies & Policy",
            "Educational Strategies & Policy",
            "Bullying & Anti-bullying Strategies",
            "Bullying & Anti-bullying Strategies",
            "Pre-school & Kindergarten",
            "Pre-school & Kindergarten",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 2
    },
    {
        "_id": "product",
        "id": "9262a19b-e505-475f-aa61-f52a4316160f",
        "name": "Kids Deserve It! Pushing Boundaries and Challenging Conventional Thinking",
        "searchName": "kids deserve it! pushing boundaries and challenging conventional thinking",
        "description": "What if learning was exciting? What if students felt important and empowered every time they walked into the building? What if parents looked forward to calls from their children's teachers and principals, instead of cringing when the school's number popped up on their phones? To Todd Nesloney and Adam Welcome, those aren't far-fetched what ifs; they can (and should) be a reality for every teacher, school, parent, and student. In Kids Deserve It!, Todd and Adam encourage you to think big and make learning fun and meaningful for students. While you're at it, you just might rediscover why you became an educator in the first place. Learn why you should be calling parents to praise your students (and employees). Discover ways to promote family interaction and improve relationships for kids at school and at home. Be inspired to take risks, shake up the status quo, and be a champion for your students. #KidsDeserveIt",
        "price": 3,
        "quantity": 74396,
        "evidence": false,
        "discount": 25,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9969/9780996989527.jpg"
        ],
        "categories": [
            "Organization & Management Of Education",
            "Organization & Management Of Education",
            "Teaching Staff",
            "Teaching Staff",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 2.25
    },
    {
        "_id": "product",
        "id": "a011eeb5-2877-47df-b550-05b7dbedaa6c",
        "name": "Vegan Pregnancy 101 : Pregnancy Handbook for First Time Vegan Moms and Babies +recipes",
        "searchName": "vegan pregnancy 101 : pregnancy handbook for first time vegan moms and babies +recipes",
        "description": "If you know the amazing results veganism can produce by following the lifestyle yourself, or maybe seeing the positive changes in one of your friends. You probably can't wait to share the benefits of veganism with your baby. Well your in luck! Veganism is just as healthy for babies as it is for adults. In fact, the Academy of Nutrition and Dietics have deemed a plant based diet healthy at any age, including throughout infancy. Although, just as when weaning your baby with any other diet, you'll need to be very strict with what you feed your baby to insure he/she is of perfect health. You need to be careful to not exclude nutrients only found in certain foods, in particularly, you should try to incorporate foods with vitamin D, calcium and vitamin B12, as these nutrients are primarily only found in animal foods. Just like with any diet. It will take patience, and trial and error to perfect. This books goal is to serve as a guide for you as you are starting your journey in a society where information on vegan pregnancies is not yet so readily available.",
        "price": 16,
        "quantity": 80763,
        "evidence": false,
        "discount": 49,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/7179/9781717911346.jpg"
        ],
        "categories": [
            "Vegetarian Cookery"
        ],
        "discountedPrice": 8.16
    },
    {
        "_id": "product",
        "id": "3dada5b5-a2f3-406b-aa5a-71af932a83b8",
        "name": "Science in Agriculture : Advanced Methods for Sustainable Farming",
        "searchName": "science in agriculture : advanced methods for sustainable farming",
        "description": "By ignoring the truth, ag-chemical enthusiasts are able to claim that pesticides and herbicides are necessary to feed the world. But science points out that low-to-mediocre crop production, weed, disease, and insect pressures are all symptoms of nutritional imbalances and inadequacies in the soil. Science in Agriculture is a concise recap of the main schools of thought that make up eco-agriculture all clearly explained. Gain a working knowledge of chemistry, physics, and plant biology as applied to agriculture. Discover what weeds are trying to tell you about your soil's fertility needs. Learn how to design and implement a program to produce crops, pastures, turf, landscape or ornamentals of balanced nutritional and mineral content. Both farmer and professional consultant will benefit from this important work.",
        "price": 20,
        "quantity": 6049,
        "evidence": false,
        "discount": 53,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9113/9780911311358.jpg"
        ],
        "categories": [
            "Science: General Issues",
            "Agricultural Science",
            "Sustainable Agriculture",
            "Agronomy & Crop Production"
        ],
        "discountedPrice": 9.4
    },
    {
        "_id": "product",
        "id": "e5c327ee-abfe-4206-b111-7db1bba4f965",
        "name": "60-second CPD : 239 ideas for busy teachers",
        "searchName": "60-second cpd : 239 ideas for busy teachers",
        "description": "Teaching is tough, yet its rewards are huge. Every teacher wants to carry on getting better and better at what they do, but when you have so much on your plate already and only so many hours in the day, how can you find time for professional development? That's where 60-Second CPD comes in. This book is a compendium of 239 easily accessible ideas and theories for professional development, each digestible in roughly 60 seconds. It's a book that every teacher and leader, in every primary and secondary school, can return to again and again as the year moves on and their career progresses. Hanna Beech and Ross Morrison McGill have distilled the million and one ideas out there into one practical, concise and inspiration-packed book designed to build knowledge, provide opportunities for deep thought and reflection, and facilitate the sharing of ideas among colleagues and teams.",
        "price": 3,
        "quantity": 42534,
        "evidence": false,
        "discount": 9,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9136/9781913622107.jpg"
        ],
        "categories": [
            "Teaching Resources & Education",
            "Teaching Resources & Education",
            "Educational Strategies & Policy",
            "Educational Strategies & Policy",
            "Inclusive Education / Mainstreaming",
            "Inclusive Education / Mainstreaming",
            "Organization & Management Of Education",
            "Organization & Management Of Education",
            "Teaching Staff",
            "Teaching Staff",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 2.73
    },
    {
        "_id": "product",
        "id": "bfe94ae8-9e40-40a9-a6a6-3bbf36752ddb",
        "name": "A Quiet Education : Challenging the extrovert ideal in our schools",
        "searchName": "a quiet education : challenging the extrovert ideal in our schools",
        "description": "'A Quiet Education' serves as an unashamed cheerleader for all that is quiet, challenging the myth that collaboration and noise should be at the heart of what happens in schools. It examines how we can ensure more introverted students and teachers can thrive and achieve their potential. It also explores why it is essential that all teachers begin to embrace quieter values: in their classrooms and management of behaviour; in sustaining their own wellbeing; in their desire to reflect meaningfully and improve as a teacher. The final section is an exploration of quieter skills: how we can strengthen our students' metacognitive ability; their ability to listen, pay attention and focus; the quality of independent work we do in the classroom alongside how we can motivate all our students.",
        "price": 19,
        "quantity": 8050,
        "evidence": false,
        "discount": 13,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9129/9781912906758.jpg"
        ],
        "categories": [
            "Educational Psychology",
            "Educational Psychology",
            "Inclusive Education / Mainstreaming",
            "Inclusive Education / Mainstreaming",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Of Specific Groups & Persons With Special Educational Needs",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 16.53
    },
    {
        "_id": "product",
        "id": "9cc46c29-9279-4ccc-921d-ee4c150a0482",
        "name": "Vegan Tapas : 150 Quick and Delicious Snacks and Bites for Sharing",
        "searchName": "vegan tapas : 150 quick and delicious snacks and bites for sharing",
        "description": "Now you can enjoy tasty vegan cuisine with your friends and family. Featuring recipes perfect for tapas, meze, buffets, picnics or for simply enjoying in front of the TV. All are simple to prepare and made using accessible, everyday ingredients, making them suitable for all levels of experience. Vegans and vegetarians will love the variety offered by Vegan Tapas. Yet this easy to use book is also useful for anyone who has to cater for a vegan or vegetarian. It can be tricky knowing what to cook for a vegan or vegetarian when you are not used to cooking this way. Vegan Tapas has the answer. The book features nine chapters: dips; toppings; vegetables; tofu and 'cheese'; grains pulses and nuts; potatoes; bread; polenta and fritters; pastries and biscuits; desserts. There is something for everyone and you will not be stuck for ideas. Whether you are sharing with one other or a crowd, you are sure to find something to please.",
        "price": 17,
        "quantity": 81855,
        "evidence": false,
        "discount": 45,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/9807/9780980759075.jpg"
        ],
        "categories": [
            "Vegetarian Cookery"
        ],
        "discountedPrice": 9.35
    },
    {
        "_id": "product",
        "id": "76032ed6-b0e5-4323-82a0-81ef9a402544",
        "name": "The Arctic Guide : Wildlife of the Far North",
        "searchName": "the arctic guide : wildlife of the far north",
        "description": "The Arctic Guide presents the traveler and naturalist with a portable, authoritative guide to the flora and fauna of earth's northernmost region. Featuring superb color illustrations, this one-of-a-kind book covers the complete spectrum of wildlife--more than 800 species of plants, fishes, butterflies, birds, and mammals--that inhabit the Arctic's polar deserts, tundra, taiga, sea ice, and oceans. It can be used anywhere in the entire Holarctic region, including Norway's Svalbard archipelago, Siberia, the Russian Far East, islands of the Bering Sea, Alaska, the Canadian Arctic, and Greenland. Detailed species accounts describe key identification features, size, habitat, range, scientific name, and the unique characteristics that enable these organisms to survive in the extreme conditions of the Far North. A color distribution map accompanies each species account, and alternative names in German, French, Norwegian, Russian, Inuit, and Inupiaq are also provided.",
        "price": 1,
        "quantity": 85970,
        "evidence": false,
        "discount": 53,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/6911/9780691139753.jpg"
        ],
        "categories": [
            "Science: General Issues",
            "Zoology & Animal Sciences",
            "Conservation Of Wildlife & Habitats",
            "Natural History Books",
            "Wildlife: General Interest",
            "Wildlife: Birds & Birdwatching",
            "Wildlife: Mammals",
            "Wildlife: Butterflies, Other Insects & Spiders",
            "Trees, Wildflowers & Plants",
            "Guidebooks",
            "Eco-tourist Guides"
        ],
        "discountedPrice": 0.47
    },
    {
        "_id": "product",
        "id": "128d0176-c013-45ac-94ff-44e1bcabc41d",
        "name": "Leadership : Key Competencies for Whole-System Change",
        "searchName": "leadership : key competencies for whole-system change",
        "description": "Develop a creative, productive school culture. Based on their decades-long work in leadership, the authors offer seven core leadership competencies for systemic change in schools, districts, and state education systems. Discover targeted strategies to move past failed initiatives and overcome initiative overload, explore how to cultivate effective work practices, and gain the know-how to create enjoyable, innovative learning environments.",
        "price": 16,
        "quantity": 71676,
        "evidence": false,
        "discount": 96,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/9367/9781936763528.jpg"
        ],
        "categories": [
            "Organization & Management Of Education",
            "Organization & Management Of Education",
            "Teaching Staff",
            "Teaching Staff",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 0.64
    },
    {
        "_id": "product",
        "id": "ac98ac15-7914-43a2-bd41-eb5698582d69",
        "name": "Becoming Literate Update",
        "searchName": "becoming literate update",
        "description": "From her lifelong study of children's development and learning, Marie Clay traces children's paths of progress in literacy learning. Acclaimed a classic since its first publication, Becoming Literate: The Construction of Inner Control is essential reading for teachers and educators committed to enabling all children to become literate.",
        "price": 20,
        "quantity": 53865,
        "evidence": false,
        "discount": 34,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3250/9780325074429.jpg"
        ],
        "categories": [
            "Educational Strategies & Policy",
            "Educational Strategies & Policy",
            "Teaching Staff",
            "Teaching Staff",
            "Primary & Middle Schools",
            "Primary & Middle Schools",
            "Teacher Training",
            "Teacher Training",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Teaching Of A Specific Subject",
            "Teaching Of A Specific Subject",
            "English Language: Reading & Writing Skills",
            "Children's Foreign Language Books"
        ],
        "discountedPrice": 13.2
    },
    {
        "_id": "product",
        "id": "c77bb3e8-44ce-4815-b258-2a92fa9fab88",
        "name": "Vegetarian Slow Cooker Recipe Book : 30 Easy Set It & Forget It Meals",
        "searchName": "vegetarian slow cooker recipe book : 30 easy set it & forget it meals",
        "description": "Get best selling author Maria Holmes' 30 favorite vegetarian slow cooker recipes! Vegetarian Slow Cooker Recipe Book: 30 Easy Set It & Forget It Meals is the first book written by Maria Holmes, a home cook with a passion for preparing simple and delicious meals for her family and friends. Over the past few months, Maria's family has been trying to convince her to share her love for, and knowledge of, cooking. After much persuasion, Maria decided to write her first cookbook. This brand new best selling vegetarian slow cooker recipe book is a compilation of 30 delicious, healthy and easy to prepare meat-free crockpot meals. Each of these recipes have been prepared by Ms. Holmes herself and tested on not only her family, but countless food connoisseurs who gave these meals two thumbs up for pleasant flavors, fragrant aromas, great textures and amazing colors. The book has a great introduction to vegetarian slow cooking and the recipes are divided into six chapters. In the introduction, readers will learn the benefits of slow cooking and the keys to preparing successful slow-cooker meals. You will also discover useful guidelines to help you adapt your favorite slow cooker recipes to meet your own individual tastes. Other useful advice includes how to choose the perfect slow cooker recipes and how to add the ingredients into the slow cooker to ensure that your recipes come out picture-perfect and delicious every time. The last part of the introduction includes clear, step-by-step instructions and helpful tips for cooking dried beans in a slow cooker. But Chapter 1 through Chapter 6 is where you will find all the delectably tasty and healthy vegetarian slow cooker recipes. Even if you are not a vegetarian, you will find that these delicious recipes can please everyone's palates. So, here is the list of those vegetarian slow cooker recipes that are waiting for you to enjoy: - Chapter 1: Soups - Chapter 2: Beans - Chapter 3: Chilies - Chapter 4: Potatoes - Chapter 5: Rices - Chapter 6: Desserts In conclusion, Vegetarian Slow Cooker Recipe Book: 30 Easy Set it & Forget It Meals by Maria Holmes is the ultimate choice for anyone who wishes to prepare easy set it and forget vegetarian slow cooker meals.",
        "price": 11,
        "quantity": 57114,
        "evidence": false,
        "discount": 69,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4944/9781494477370.jpg"
        ],
        "categories": [
            "Quick & Easy Cooking",
            "Vegetarian Cookery"
        ],
        "discountedPrice": 3.41
    },
    {
        "_id": "product",
        "id": "dd5192bb-18ea-458a-8657-4aa8baf3c486",
        "name": "A Realist Theory of Science",
        "searchName": "a realist theory of science",
        "description": "A Realist Theory of Science is one of the few books that have changed our understanding of the philosophy of science. In this analysis of the natural sciences, with a particular focus on the experimental process itself, Roy Bhaskar provides a definitive critique of the traditional, positivist conception of science and stakes out an alternative, realist position. Since it original publication in 1975, a movement known as 'Critical Realism', which is both intellectually diverse and international in scope, has developed on the basis of key concepts outlined in the text. The book has been hailed in many quarters as a 'Copernican Revolution' in the study of the nature of science, and the implications of its account have been far-reaching for many fields of the humanities and social sciences.",
        "price": 16,
        "quantity": 14148,
        "evidence": false,
        "discount": 87,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8446/9781844672042.jpg"
        ],
        "categories": [
            "Philosophy",
            "Philosophy Of Science"
        ],
        "discountedPrice": 2.08
    },
    {
        "_id": "product",
        "id": "24faa287-938b-494a-8dac-6999ee244415",
        "name": "25 Quick Formative Assessments for a Differentiated Classroom : Easy, Low-Prep Assessments That Help You Pinpoint Students' Needs and Reach All Learners",
        "searchName": "25 quick formative assessments for a differentiated classroom : easy, low-prep assessments that help you pinpoint students' needs and reach all learners",
        "description": "This new edition of this best-selling resource includes new and updated formative assessment templates, technology connections with easy-to-use digital applications for every assessment, a new section on rubrics and self-assessments, a new focus on scaffolding ELLs, and so much more! These ready-to-go activities-complete with step-by-step lessons, student samples, tiering tips, and reproducible student pages-can be used across the curriculum and provide valuable assessment data for teachers.",
        "price": 16,
        "quantity": 78952,
        "evidence": false,
        "discount": 86,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/3381/9781338135169.jpg"
        ],
        "categories": [
            "Examinations & Assessment",
            "Examinations & Assessment",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 2.24
    },
    {
        "_id": "product",
        "id": "4635b46a-e4d3-4c2c-9a21-d6155f5829a1",
        "name": "Management and Cost Accounting, Student Manual",
        "searchName": "management and cost accounting, student manual",
        "description": "Drury's Management & Cost Accounting is the market-leading European text on management accounting and is a comprehensive authority on all aspects of the subject.",
        "price": 18,
        "quantity": 59711,
        "evidence": false,
        "discount": 95,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8448/9781844805686.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "Cost Accounting",
            "Management Accounting & Bookkeeping"
        ],
        "discountedPrice": 0.9
    },
    {
        "_id": "product",
        "id": "80af7d81-4593-41f6-ac9d-0d1f20dec01b",
        "name": "Peace to All Beings : Veggie Soup for the Chickens Soul",
        "searchName": "peace to all beings : veggie soup for the chickens soul",
        "description": "This visionary book of hope for a world at peace is also an excellent reference for animal activists who wish to explore the interconnectedness of animal rights, ecology, world peace and social justice. Peace to All Beings shows how animal rights and liberation are an essential part of any movement that is working to make the world a better place. It is a valuable aid for anyone seeking to live in harmony with the values of compassion, nonviolence and reverence for all life.",
        "price": 15,
        "quantity": 9811,
        "evidence": false,
        "discount": 99,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5905/9781590560051.jpg"
        ],
        "categories": [
            "Spirituality & Religious Experience",
            "Religious Life & Practice",
            "Animals & Society",
            "Advice On Careers & Achieving Success",
            "Vegetarian Cookery"
        ],
        "discountedPrice": 0.15
    },
    {
        "_id": "product",
        "id": "3c89335c-c599-4f2b-a4bd-4fc82ba34932",
        "name": "The World As I See It",
        "searchName": "the world as i see it",
        "description": "The most advanced and celebrated mind of the 20th Century, without a doubt, is attributed to Albert Einstein. Instead of his hard science and advanced mathematical theories, which often go far beyond the minds of average people, this book allows us to meet him as a person. This interesting book allows us to explore his beliefs, philosophical ideas, and opinions on many subjects so we can walk away afterwards knowing and understanding one of the world's greatest intellectual giants. Subjects include politics, religion, education, the meaning of life, Jewish issues, the world economy, peace and pacifism. One does not need an advanced degree in math or physics to appreciate the genius of Einstein, shared so clearly by the man himself in this book.",
        "price": 10,
        "quantity": 47302,
        "evidence": false,
        "discount": 32,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5850/9781585092871.jpg"
        ],
        "categories": [
            "Literary Essays",
            "Peace Studies & Conflict Resolution",
            "Peace Studies & Conflict Resolution",
            "Philosophy",
            "Western Philosophy: Medieval & Renaissance, C 500 To C 1600",
            "Social & Political Philosophy",
            "Jewish Books",
            "Society & Culture: General",
            "Politics & Government",
            "Science: General Issues",
            "Philosophy Of Science",
            "Physics Books",
            "Mathematical Physics"
        ],
        "discountedPrice": 6.8
    },
    {
        "_id": "product",
        "id": "29339570-0f64-4eba-8e97-463c08786faa",
        "name": "On Course : A Week-by-Week Guide to Your First Semester of College Teaching",
        "searchName": "on course : a week-by-week guide to your first semester of college teaching",
        "description": "You go into teaching with high hopes: to inspire students, to motivate them to learn, to help them love your subject. Then you find yourself facing a crowd of expectant faces on the first day of the first semester, and you think \"Now what do I do?\"",
        "price": 5,
        "quantity": 62699,
        "evidence": false,
        "discount": 5,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/6740/9780674047419.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Higher & Further Education, Tertiary Education",
            "Higher & Further Education, Tertiary Education",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 4.75
    },
    {
        "_id": "product",
        "id": "ebbc66a1-1803-4a93-8046-3e34dddcfdf0",
        "name": "Journal Keeping : How to Use Reflective Journals for Effective Teaching and Learning, Professional Insight, and Positive Change",
        "searchName": "journal keeping : how to use reflective journals for effective teaching and learning, professional insight, and positive change",
        "description": "This book is written by the authors of the acclaimed \"\"Introduction to Rubrics\"\". It has sold over 3,000 in 12 months. There is a major growth of interest in keeping journals or diaries for personal reflection and growth; and as a teaching tool. It will appeal to college faculty, administrators and teachers. One of the most powerful ways to learn, reflect and make sense of our lives is through journal keeping. This book presents the potential uses and benefits of journals for personal and professional development - particularly for those in academic life; and demonstrates journals' potential to foster college students' learning, fluency and voice, and creative thinking. In professional life, a journal helps to organize, prioritize and address the many expectations of a faculty member's or administrator's roles. Journals are effective for developing time management skills, building problem-solving skills, fostering insight, and decreasing stress. Both writing and rereading journal entries allow the journal keeper to document thinking; to track changes and review observations; and to examine assumptions and so gain fresh perspectives and insights over past events. The authors present the background to help readers make an informed decision about the value of journals and to determine whether journals will fit appropriately with their teaching objectives or help manage their personal and professional lives. They offer insights and advice on selecting the format or formats and techniques most appropriate for the reader's purposes.",
        "price": 8,
        "quantity": 98897,
        "evidence": false,
        "discount": 10,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5792/9781579222161.jpg"
        ],
        "categories": [
            "Teaching Staff",
            "Teaching Staff",
            "Higher & Further Education, Tertiary Education",
            "Higher & Further Education, Tertiary Education",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 7.2
    },
    {
        "_id": "product",
        "id": "ba99e729-9ff7-4a25-b97f-197850f2f53d",
        "name": "Rawlicious At Home : More than 100 Raw, Vegan and Gluten-free Recipes to Make You Feel Great",
        "searchName": "rawlicious at home : more than 100 raw, vegan and gluten-free recipes to make you feel great",
        "description": "From the owners of the Rawlicious raw food restaurants, comes an inspiring, easy-to-follow cookbook. Learn about the numerous benefits of raw food and how to make healthy, simple and delicious raw meals at home.",
        "price": 12,
        "quantity": 17019,
        "evidence": false,
        "discount": 65,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/4490/9780449016183.jpg"
        ],
        "categories": [
            "Health & Wholefood Cookery",
            "Vegetarian Cookery"
        ],
        "discountedPrice": 4.2
    },
    {
        "_id": "product",
        "id": "cd55bb7a-dd4b-4408-a0ba-07d593e1a259",
        "name": "Pythagoras : His Lives and the Legacy of a Rational Universe",
        "searchName": "pythagoras : his lives and the legacy of a rational universe",
        "description": "This is the story of Pythagoras and the Pythagoreans, whose insights transformed the ancient world and still inspire the realms of science, mathematics, philosophy and the arts. Einstein said that the most incredible thing about our universe was that it was comprehensible at all. As Kitty Ferguson explains, Pythagoras had much the same idea - but 2,500 years earlier. Though known by many only for his famous Theorem, in fact the pillars of our scientific tradition - belief that the universe is rational, that there is unity to all things, and that numbers and mathematics are a powerful guide to truth about nature and the cosmos - hark back to the convictions of this legendary scholar. Kitty Ferguson brilliantly evokes Pythagoras' ancient world of, showing how ideas spread in antiquity, and chronicles the incredible influence he and his followers have had on so many extraordinary people in the history of Western thought and science. 'Pythagoras' influence on the ideas, and therefore on the destiny, of the human race was probably greater than that of any single man before or after him' - Arthur Koestler.",
        "price": 4,
        "quantity": 66474,
        "evidence": false,
        "discount": 59,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/8483/9781848312319.jpg"
        ],
        "categories": [
            "History Of Science"
        ],
        "discountedPrice": 1.64
    },
    {
        "_id": "product",
        "id": "ab1f5580-e2b9-4852-88b0-7c98c37938c5",
        "name": "A Word a Day Grade 2",
        "searchName": "a word a day grade 2",
        "description": "Don't just memorize vocabulary words--give your students the tools they need to understand and apply them!",
        "price": 14,
        "quantity": 35081,
        "evidence": false,
        "discount": 17,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5967/9781596734081.jpg"
        ],
        "categories": [
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques",
            "English Language: Reading & Writing Skills"
        ],
        "discountedPrice": 11.62
    },
    {
        "_id": "product",
        "id": "2655ec6a-6121-4194-ac3e-e44f243f797b",
        "name": "Best Practices in Gifted Education : An Evidence-Based Guide",
        "searchName": "best practices in gifted education : an evidence-based guide",
        "description": "Best Practices in Gifted Education provides concise, up-to-date, research-based advice to educators, administrators, and parents of gifted and talented youth. The 29 practices included in this volume are the result of an extensive examination of educational research on what works with talented youth. The interest in culturally diverse and low-income learners, the means to identify talents, and the need for curriculum that appropriately challenges high-ability youth constitute just a few of the 29 practices.",
        "price": 7,
        "quantity": 44884,
        "evidence": false,
        "discount": 89,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/5936/9781593632106.jpg"
        ],
        "categories": [
            "Examinations & Assessment",
            "Examinations & Assessment",
            "Teaching Of Gifted Students",
            "Teaching Of Gifted Students",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 0.77
    },
    {
        "_id": "product",
        "id": "bf4c7105-b2b3-48d8-952c-511188c23940",
        "name": "The Oat Milk Cookbook : More than 100 Delicious, Dairy Free Vegan Recipes",
        "searchName": "the oat milk cookbook : more than 100 delicious, dairy free vegan recipes",
        "description": "Oat milk is the latest trend in healthy gut food, and this easy-to-use cookbook helps you enjoy its benefits with more than 100 delicious recipes--all naturally free of dairy and lactose.   Oat milk, as a vegan alternative to cow's milk, is gaining widespread popularity due to its delicious flavor and impressive nutrient profile as an excellent source of calcium, Vitamin D, and heart-healthy fiber. Plus, it's naturally free of lactose, making it ideal for anyone with dietary restrictions, allergies, digestive distress, and other gut troubles. These 100 recipes will make oat milk an everyday ingredient in all the foods you crave--without compromising flavor! You'll find a wide array of mouthwatering, easy-to-make dishes, including rich desserts, snacks, smoothies, and of course main meals.",
        "price": 15,
        "quantity": 14200,
        "evidence": false,
        "discount": 31,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9781/4549/9781454938187.jpg"
        ],
        "categories": [
            "Health & Wholefood Cookery",
            "Vegetarian Cookery"
        ],
        "discountedPrice": 10.35
    },
    {
        "_id": "product",
        "id": "f5e62f13-85e4-4657-8842-a8fe10e6b12a",
        "name": "The Seventh Sense : Power, Fortune, and Survival in the Age of Networks",
        "searchName": "the seventh sense : power, fortune, and survival in the age of networks",
        "description": "NEW YORK TIMES BESTSELLER",
        "price": 17,
        "quantity": 17850,
        "evidence": false,
        "discount": 49,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3162/9780316285063.jpg"
        ],
        "categories": [
            "Social Forecasting, Future Studies",
            "Economic Systems & Structures",
            "Economic Systems & Structures",
            "Information Technology Industries",
            "Impact Of Science & Technology On Society",
            "Ethical & Social Aspects Of Computing"
        ],
        "discountedPrice": 8.67
    },
    {
        "_id": "product",
        "id": "5d289372-75d3-44f8-bdd1-3d213bf0477c",
        "name": "The Power of Grammar",
        "searchName": "the power of grammar",
        "description": "Grammar is the gatekeeper to a culture of power, yet it is also the power behind the startling beauty and robustness of the English language. In The Power of Grammar, Mary Ehrenworth and Vicki Vinton show you how these two notions of power can help your grammar instruction address the practical and aesthetic needs of your student writers.",
        "price": 10,
        "quantity": 42191,
        "evidence": false,
        "discount": 19,
        "images": [
            "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/3250/9780325006888.jpg"
        ],
        "categories": [
            "Historical & Comparative Linguistics",
            "Language Teaching & Learning (other Than ELT)",
            "Teaching Skills & Techniques",
            "Teaching Skills & Techniques"
        ],
        "discountedPrice": 8.1
    }
]